<template>
  <div class="service-details">
    <!--头部编号信息-->
    <div class="box1">
      <span class="left">服务编号：
        <em v-if="passStatus">{{detail.orderNo}}</em>
        <em v-else>(付款后自动生成)</em>
      </span>
      <span class="status" v-if="detail.status === 0 && detail.payStatus === 0">待支付</span>
      <span class="status" v-else-if="detail.status === 0 && detail.payStatus === 1">待审核</span>
      <span class="status" v-else-if="detail.status === 1 && detail.payStatus === 1">已完成</span>
      <span class="status danger" v-else-if="detail.status === 2 && detail.payStatus === 1">已退回</span>
      <span class="status danger" v-else-if="detail.status === 2 && detail.payStatus === 2">已退款</span>
    </div>

    <!--车主信息-->
    <div class="box2">
      <div class="head">
        <div class="wrap">
          <i class="icon-owner"></i>
          <span>车主信息</span>
        </div>
      </div>

      <ul class="list">
        <li>
          <span class="left-text">车主</span>
          <span class="right-text">{{detail.nickname}}</span>
        </li>
        <li>
          <span class="left-text">联系人</span>
          <span class="right-text">{{detail.realName}}</span>
        </li>
        <li>
          <span class="left-text">手机号</span>
          <span class="right-text">{{detail.phone}}</span>
        </li>
        <li>
          <span class="left-text">联系地址</span>
          <span class="right-text">{{detail.address}}</span>
        </li>
        <li>
          <span class="left-text">邮箱</span>
          <span class="right-text">{{detail.email}}</span>
        </li>
      </ul>


      <img class="bottom-line" src="../assets/img/img_envelope.png">
    </div>

    <!--车辆信息-->
    <div class="box3">
      <div class="head">
        <div class="wrap">
          <i class="icon-car"></i>
          <span>车辆信息</span>
        </div>
      </div>

      <ul class="list">
        <li>
          <span class="left-text">品牌</span>
          <span class="right-text">{{detail.brand}}</span>
        </li>
        <li>
          <span class="left-text">车系</span>
          <span class="right-text">{{detail.carSeries}}</span>
        </li>
        <li>
          <span class="left-text">车型</span>
          <span class="right-text">{{detail.carModel}}</span>
        </li>
        <li>
          <span class="left-text">配置版本</span>
          <span class="right-text">{{detail.configure}}</span>
        </li>
        <li>
          <span class="left-text">排量</span>
          <span class="right-text">{{detail.volume}}</span>
        </li>
        <li>
          <span class="left-text">车牌号码</span>
          <span class="right-text">{{detail.licensePlate}}</span>
        </li>
        <li>
          <span class="left-text">车辆识别号</span>
          <span class="right-text">{{detail.recognitionCode}}</span>
        </li>
        <li>
          <span class="left-text">发动机号</span>
          <span class="right-text">{{detail.engineNumber}}</span>
        </li>
        <li>
          <span class="left-text">当前行驶里程</span>
          <span class="right-text">{{detail.steerMileage}}</span>
        </li>
        <li>
          <span class="left-text">注册日期</span>
          <span class="right-text">{{detail.registerDate}}</span>
        </li>
        <li>
          <span class="left-text">使用性质</span>
          <span class="right-text" v-if="detail.nature === 0">未填写</span>
          <span class="right-text" v-else-if="detail.nature === 1">营运</span>
          <span class="right-text" v-else-if="detail.nature === 2">非营运</span>
        </li>
        <li>
          <span class="left-text">车龄</span>
          <span class="right-text">{{detail.carAge}}个月</span>
        </li>
        <li>
          <span class="left-text">是否涡轮增压</span>
          <span class="right-text" v-if="detail.turbine === 1">是</span>
          <span class="right-text" v-else-if="detail.turbine === 2">否</span>
        </li>
        <li>
          <span class="left-text">是否四驱</span>
          <span class="right-text" v-if="detail.quattro === 1">是</span>
          <span class="right-text" v-else-if="detail.quattro === 2">否</span></li>
      </ul>
    </div>

    <!--延保信息-->
    <div class="box4">
      <div class="head">
        <div class="wrap">
          <i class="icon-extend"></i>
          <span>延保信息</span>
        </div>
      </div>

      <ul class="list">
        <li>
          <span class="left-text">产品名称</span>
          <span class="right-text">{{detail.productName}}</span>
        </li>
        <li>
          <span class="left-text">延保范围</span>
          <span class="right-text">{{detail.guaranteeScope}}</span>
        </li>
        <li>
          <span class="left-text">保障年限</span>
          <span class="right-text">{{detail.guaranteeDeadline}}个月</span>
        </li>
        <li>
          <span class="left-text">
            <em>保障里程</em>
            <em class="blue-text">(车辆最终保障里程不超过{{range}}公里)</em>
          </span>
          <span class="right-text">{{detail.guaranteeMileage}}公里</span>
        </li>
        <li>
          <span class="left-text">合约生效日期起止</span>
          <span class="right-text">{{detail.startTime}} — {{detail.endTime}}</span>
        </li>
        <li>
          <span class="left-text">赔付限额</span>
          <span class="right-text">{{detail.guaranteePrice}}元</span>
        </li>
      </ul>
    </div>

    <!--审核通过-->
    <div v-show="contractStatus" class="wrapper">
      <!--服务费-->
      <div class="box5">
        <span class="left-text">服务费</span>
        <span class="danger">&yen;{{detail.cost}}</span>
      </div>

      <div class="btn" @click="seaContract">查看电子合约</div>
    </div>

    <!--未付款-->
    <div class="wrapper" v-show="payStatus">
      <ul class="deal-list">
        <li>
          <em>查看<span @click="condition = true">准入条件</span></em>
          <i v-if="entryStatus" class="icon-checked" @click="entryStatus = false"></i>
          <i v-else class="icon-checkbox" @click="entryStatus = true"></i>
        </li>
        <li>
          <em>查看<span @click="fnPrompt">保障范围</span></em>
          <i v-if="scopeStatus" class="icon-checked" @click="scopeStatus = false"></i>
          <i v-else class="icon-checkbox" @click="scopeStatus = true"></i>
        </li>
        <li>
          <em>查看<span @click="claims = true">理赔流程</span></em>
          <i v-if="flowStatus" class="icon-checked" @click="flowStatus = false"></i>
          <i v-else class="icon-checkbox" @click="flowStatus = true"></i>
        </li>
      </ul>

      <!--充分阅读协议-->
      <div class="read">
        <i v-if="readStatus" class="icon-checkeds" @click="readStatus = false"></i>
        <i v-else class="icon-check" @click="readStatus = true"></i>

        <p class="deal-text">我已充分了解以上内容、包括《准入条件》、《保障范围》、《理赔流程》，完全理解并勾选表示同意以上条件</p>
      </div>
    </div>

    <div class="footer" v-show="payStatus">
      <div class="left">服务费：<span>&yen;{{detail.cost}}</span></div>
      <div class="btn-pay" @click="confirmPay">确认支付</div>
    </div>


    <!--查看准入条件弹窗-->
    <div class="condition" v-show="condition">
      <div class="content">
        <h4 class="title">准入条件</h4>

        <div class="wrap">
          <ul>
            <li>（1）适用于原厂保修期3年10万公里和3年6万公里的投保车辆；</li>
            <li>（2）投保车辆购买产品时，原厂保修期和当前行驶里程须小于原厂保修期截止前3个月且保修里程截止前5000公里（保修时间和保修里程须同时满足，例如原厂保修期为36个月10万公里，投保车辆须在33个月且95000公里内方可购买，原厂保修期时间以新车购车发票日期为准计算）</li>
            <li>（3）投保车辆为7座及以下非营运车辆</li>
            <li>（4）混动、电动、天然气、转子发动机等以外的纯燃油车辆</li>
            <li>（5）特殊用途的车辆，例如教练车、赛车、改装车等不承保</li>
            <li>（6）超豪华车、非量产车、平行进口车等不承保</li>
          </ul>
        </div>
      </div>
      <div class="btn-close" @click="condition = false"></div>
    </div>

    <!--查看保障范围弹窗-->

    <!--一大件-->
    <div v-show="scopeStatus1" class="scope-window">
      <div class="box">
        <h3 class="title">延保产品范围</h3>
        <div class="content-wrap">
          <p class="start-text">
            本延长保修服务合约若承保车辆的零部件因材料质量和制造工艺有关的缺陷（不包含厂家召回的情形）在延长保修期内出现了故障，我们将为您承担维修费用，最高维修费用为您购买本服务合约产品中约定的赔付限额。本服务合约产品有以下保修部件范围可以选择投保：</p>
          <h5 class="main-title">一、一大件：发动机</h5>
          <h5 class="small-title">(一) 被保修部分如下：</h5>
          <h6 class="subhead">1、发动机部分</h6>
          <p>包括气缸盖部分、正时部分、气缸体部分。</p>
          <h6 class="subhead">气缸盖部分：</h6>
          <p>
            气缸盖、气门室盖、气门室盖分油板、气缸盖衬垫、凸轮轴瓦盖、凸轮轴瓦架、凸轮偏心轴瓦盖、凸轮偏心轴瓦架、凸轮轴瓦、凸轮轴、偏心轴、进气门、排气门、气门导管、气门弹簧及弹簧座、气门锁片、气门挺柱、气门挺杆、气门推杆、气门摇臂、气门摇臂轴、气门摇臂衬套、气门间隙调整螺钉。</p>

          <h6 class="subhead">正时部分：</h6>
          <p>
            金属材质的时规盖、金属材质的正时链条外罩、正时齿轮、正时链轮、正时链条、正时链条涨紧轮、正时链条涨紧器、正时链条导板、正时皮带（保修前提：车主按车辆制造商要求进行了定期更换）、正时皮带涨紧轮、正时皮带涨紧器、凸轮轴齿盘（可变配气相位机构）、可变配气相位机械执行机构。</p>

          <h6 class="subhead">气缸体部分：</h6>
          <p>
            气缸体、曲轴箱、缸套、活塞、活塞环、活塞销、活塞销卡圈、连杆、连杆瓦、连杆瓦盖、曲轴、曲轴瓦、曲轴链轮、止推瓦、曲轴瓦盖、曲轴瓦架、平衡轴、平衡轴齿轮、平衡轴瓦、机油滤清器支座、机油集滤器及滤网、机油泵、机油泵链轮、机油泵链条。</p>

          <h5 class="small-title">(二) 不被保修部分如下：</h5>
          <p>凡没有在“被保修部件”中列明的零部件，或虽然被列明但并非是由车辆制造商或其授权特约维修商提供并安装在车辆上的零部件，均不属于保修方案的被保修零部件，包括但不限于：</p>
          <ul>
            <li>1．车辆出厂标准配置以外的任何改装、加装或零部件的变更；</li>
            <li>2．保养件：根据生产厂家规定的周期性的保养所需更换的零部件及油液，包括但不限于更换滤清器、制动片或制动盘（鼓）、灯泡、雨刮片、轮胎、皮带等保养项目；</li>
            <li>3. 易损件：包括但不限于：轮圈、电池、火花塞、密封件、橡胶类部件、喷油嘴、减震器、玻璃、三元催化器、软件系统等常用易损件；</li>
            <li>4. 人为、外力、噪音、油和液等流体渗漏、机油损耗（机油损耗量根据各品牌生产厂家规定的标准执行）等情况。</li>
            <li>5. 所有电力驱动或者混合动力系统零部件。</li>
          </ul>

          <h5 class="main-title">二、不论哪一种保修计划，下列情形和事项下均不能获得延长保修服务：</h5>
          <h5 class="small-title">(一) 由于以下情形直接或间接导致车辆零部件（即使是被保修的零部件）发生故障：</h5>
          <h6 class="subhead">1、车辆驾驶人员未遵守保修（保养）手册中的有关操作规定，不当使用车辆，或者超出操作或使用限制范围，过度使用车辆，包括但不限于：</h6>
          <ul>
            <li>1）在车辆缺乏必要数量的冷却液或润滑油，或者仪表显示冷却液或润滑油已经过热或不足等情况下，继续驾驶车辆；</li>
            <li>2）使用与车辆制造商规定不符、不合格或者与车主手册中的规定不匹配的燃料、润滑油等油、液；</li>
            <li>3）拖拽重量超过车辆自身重量60%的其它车辆等；</li>
          </ul>
          <h6 class="subhead">2、车辆实际驾驶人员在离开车辆时，没有主动或监督门窗、车顶自动关闭系统关闭天窗、车窗、车门、或活动式车顶；</h6>
          <h6 class="subhead">3、车辆实际使用者在非约定车辆维修商处维修或者保养车辆，因维修或保养不当导致的故障；</h6>
          <h6 class="subhead">4、由于不被保修的零部件发生故障导致被保修的零部件发生损坏；</h6>
          <h6 class="subhead">5、车辆涉水行驶，发生交通事故，被外界物体撞击，自燃；</h6>
          <h6 class="subhead">6、火灾、爆炸、空中运行物体坠落、音爆；</h6>
          <h6 class="subhead">7、战争、敌对行为、军事行为、恐怖主义行为、武装冲突、罢工、民众骚乱、暴动；</h6>
          <h6 class="subhead">8、盗窃、抢劫、抢夺、诈骗行为；</h6>
          <h6 class="subhead">9、核爆炸、核反应、核辐射、放射性污染；</h6>
          <h6 class="subhead">10、地震、海啸、飓风、暴雨、洪水、雷击、火山爆发、地下火、龙卷风、暴风、冰雹等自然灾害；</h6>
          <h6 class="subhead">11、烟熏、大气、土地、水污染及其他污染；</h6>
          <h6 class="subhead">12、动物、昆虫侵入或啃咬；</h6>

          <h5 class="small-title">(二) 只要发生以下情况，无论任何原因导致车辆零部件（即使是被保修的零部件）发生故障，都不能获得延长保修服务：</h5>
          <h6 class="subhead">1、被延保车辆的发动机号码、车辆识别代号等车辆相关信息与延保服务合同中所记载的不符，或者已经被涂改；</h6>
          <h6 class="subhead">2、要求提供延保维修服务时，延长保修服务合同的服务期限尚未开始或者已经终止；</h6>
          <h6 class="subhead">3、车辆实际使用者没有按照延长保修服务合同的约定，对于车辆进行定期保养、故障维修或意外损坏修复；</h6>
          <h6 class="subhead">4、车辆被改装，不符合车辆制造商原厂规格，包括但不限于：改装或加装进排气系统零部件，改装或加装燃油系统零部件、软件变更等；</h6>
          <h6 class="subhead">5、除非符合车辆制造商原设计目的，车辆被用于竞赛、赛车前导、越野等用途；或者被用于租赁、作为出租车/计程车、教练车、配送或快递车辆等任何以盈利为目的的商业用途；</h6>
          <h6 class="subhead">6、车辆被用于公共服务(包括但不限于：警车、消防车、救护车、救助车或者军用车等)用途；</h6>
          <h6 class="subhead">7、车辆被用于非制造商原设计目的；</h6>
          <h6 class="subhead">8、车辆被政府有关当局没收、征用，或者其它类似事件使您对于车辆失去了控制；</h6>
          <h6 class="subhead">9、车辆在中国大陆（不包括香港、澳门、台湾）以外的任何地区；</h6>
          <h6 class="subhead">10、车辆的里程表失效而未被及时（48小时内）恢复，里程表连接被拆除或未连接，或者里程表读数被调整过；</h6>
          <h6 class="subhead">11、车辆实际使用者在车辆出现故障后，故意破坏其原始状态，造成故障无法被检测、鉴定、或评估；</h6>
          <h6 class="subhead">12、车辆实际使用者在车辆出现故障后，恶意夸大损失，提供不真实的证明材料，或企图使用欺诈手段谋取利益；</h6>
          <h6 class="subhead">13、车辆行驶证被吊销或者没有登记，以及车辆未按照法规检验或检验不合格。</h6>

          <h5 class="small-title">(三) 以下费用或损失，或由于以下情况引起的费用或损失，不属于延长保修服务内容，本公司不予承担：</h5>
          <h6 class="subhead">1、按照延长保修服务合同的约定，对于车辆进行定期保养所引起的费用；</h6>
          <h6 class="subhead">2、维修或更换非保修零部件所引起的费用；</h6>
          <h6 class="subhead">3、与被保修零部件无关的任何维护、保养、检测、调试、调整、或校正，包括但不限于：轮胎动平衡、车门窗密闭性校正等；</h6>
          <h6 class="subhead">4、被保修零部件仅需清洗即可恢复正常工作时的拆装和清洗等费用；</h6>
          <h6 class="subhead">5、单独车轮定位（在对被保修零部件提供延长保修服务的过程中必须进行的除外）；</h6>
          <h6 class="subhead">6、生锈、侵蚀、霉变；</h6>
          <h6 class="subhead">7、车辆没有发生故障，单纯以提高车辆的工作性能或舒适性为目的的维修所引起的费用。这种维修包括但不限于：</h6>
          <ul>
            <li>1）单纯为了提高发动机的压缩比或减少油耗，而对发动机缸体或活塞环进行的修理或更换；</li>
            <li>2）单纯为了降低车内噪音，而在车辆上添加隔音材料等；</li>
          </ul>
          <h6 class="subhead">8、延保服务合同签署时，车辆已经存在的故障所引起的维修费用；</h6>
          <h6 class="subhead">9、在车辆已经发生故障的情况下，继续行驶，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">10、在车辆已经发生故障的情况下，不及时（24小时内）向我们报告，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">11、车辆被召回维修所引起的费用；</h6>
          <h6 class="subhead">12、在维修车辆故障时，车辆内遗留的任何财/物的损失；</h6>
          <h6 class="subhead">13、车辆发生故障，或在维修期间不能使用，所引起的任何直接、间接、或衍生性费用或损失，包括但不限于：</h6>
          <ul>
            <li>1）驾乘人员或第三者的人身伤亡、财产损失、收入损失、商业利益损失、时间损失、不方便、不舒适；</li>
            <li>2）因延误、滞留、或车辆不能使用引起的通讯费、电话费、食宿费、租车费、燃料费、交通费、差旅费；</li>
            <li>2）因违反性能、时间、效率、或质量的保证所遭受的罚款等；</li>
          </ul>
          <p class="remark">注意：在车辆须经拆解才可以进行故障检测、鉴定、或评估的情况下，若拆解后发现故障不符合提供延长保修服务的条件时，拆解车辆的费用。</p>
          <h6 class="subhead">14、车辆发生故障后，车辆实际使用者在没有经过我们书面同意的情况下，对于车辆进行维修所引起的任何费用或损失；</h6>
          <h6 class="subhead">15、经国家质量技术监督检验机构或第三方专业技术机构鉴定，被延保车辆存在由于涉及制造等方面的原因而在某一批次、型号或类别的机动车辆中普遍存在的具有同一性的质量问题；</h6>
          <h6 class="subhead">16、任何原因导致的车辆价值降低损失；</h6>
          <h6 class="subhead">17、在延保合同项下的维修，已经由生产商的质保期或者其他服务合同，质量担保，机械故障保险，或维修机构担保涵盖的索赔。</h6>
        </div>
      </div>
      <div class="btn-close" @click="scopeStatus1 = false"></div>
    </div>
    <!--二大件-->
    <div v-show="scopeStatus2" class="scope-window">
      <div class="box">
        <h3 class="title">延保产品范围</h3>
        <div class="content-wrap">
          <p class="start-text">
            本延长保修服务合约若承保车辆的零部件因材料质量和制造工艺有关的缺陷（不包含厂家召回的情形）在延长保修期内出现了故障，我们将为您承担维修费用，最高维修费用为您购买本服务合约产品中约定的赔付限额。本服务合约产品有以下保修部件范围可以选择投保：</p>
          <h5 class="main-title">一、二大件：发动机 + 变速箱</h5>
          <h5 class="small-title">(一) 被保修部分如下：</h5>
          <h6 class="subhead">1、发动机部分</h6>
          <p>包括气缸盖部分、正时部分、气缸体部分。</p>
          <h6 class="subhead">气缸盖部分：</h6>
          <p>
            气缸盖、气门室盖、气门室盖分油板、气缸盖衬垫、凸轮轴瓦盖、凸轮轴瓦架、凸轮偏心轴瓦盖、凸轮偏心轴瓦架、凸轮轴瓦、凸轮轴、偏心轴、进气门、排气门、气门导管、气门弹簧及弹簧座、气门锁片、气门挺柱、气门挺杆、气门推杆、气门摇臂、气门摇臂轴、气门摇臂衬套、气门间隙调整螺钉。</p>

          <h6 class="subhead">正时部分：</h6>
          <p>
            金属材质的时规盖、金属材质的正时链条外罩、正时齿轮、正时链轮、正时链条、正时链条涨紧轮、正时链条涨紧器、正时链条导板、正时皮带（保修前提：车主按车辆制造商要求进行了定期更换）、正时皮带涨紧轮、正时皮带涨紧器、凸轮轴齿盘（可变配气相位机构）、可变配气相位机械执行机构。</p>

          <h6 class="subhead">气缸体部分：</h6>
          <p>
            气缸体、曲轴箱、缸套、活塞、活塞环、活塞销、活塞销卡圈、连杆、连杆瓦、连杆瓦盖、曲轴、曲轴瓦、曲轴链轮、止推瓦、曲轴瓦盖、曲轴瓦架、平衡轴、平衡轴齿轮、平衡轴瓦、机油滤清器支座、机油集滤器及滤网、机油泵、机油泵链轮、机油泵链条。</p>

          <h6 class="subhead">2、变速器部分</h6>
          <p>包括机械部件和附件。</p>
          <h6 class="subhead">手动变速器(MT)部件：</h6>
          <p>
            变速箱壳体总成；变速器箱本体内的润滑部件包含：各齿轮、同步器、锁环、外锥环、输入轴、输出轴、中间轴、换档杆轴、换挡拨叉、换挡机构盖、主减速器齿轮组、差速器、各种轴承/轴衬（推力轴承、滚珠轴承、滚柱轴承、锥轴承等）。</p>

          <h6 class="subhead">自动换挡式手动变速器(AMT/EMT)部件：</h6>
          <p>
            变速器壳体总成；离合器液压驱动总成；变速器箱本体内的润滑部件包含：各齿轮、同步器、锁环、外锥环、输入轴、输出轴、中间轴、倒档轴、主减速器、差速器、各种轴承/轴衬（推力轴承、滚珠轴承、滚柱轴承、锥轴承等）、换档杆轴、换档齿轮、换挡蜗轮、换挡棘轮、选档槽、选档拨叉。</p>

          <h6 class="subhead">自动变速器(AT)部件：</h6>
          <p>
            变速器壳体总成；液力变矩器总成；变速器箱本体内的润滑部件包含：主动齿轮、从动齿轮、中间介轮、差速器以及中间差速器、主减速器齿轮组、各种轴承/轴衬(向心轴承、推力轴承、滑动轴承（铜套）、圆锥滚子轴承)、输入轴、输出轴、中间轴、换档杆轴、行星架、太阳轮、齿圈、离合器鼓、离合器支架、离合器摩擦片组、离合器钢片组、离合器活塞、回位弹簧、减震波形片、压盘、卡环、制动带、制动带伺服机构、蓄压器组件。</p>

          <h6 class="subhead">无极自动变速器(CVT)部件：</h6>
          <p>
            变速器壳体总成；液力变矩器、起步离合器（输入轴）；变速器箱本体内的润滑部件包含：主动齿轮、从动齿轮、差速器、主减速器齿轮组、各种轴承/轴衬（向心轴承、推力轴承、滑动轴承（铜套）、圆锥滚子轴承）、输入轴、输出轴、中间轴、换档杆轴、含行星架、太阳轮、齿圈、离合器鼓、离合器支架、离合器摩擦片组、离合器钢片组、离合器活塞、回位弹簧、减震波形片、压盘、卡环等、主动链轮、从动链轮、传动链条/带。</p>

          <h6 class="subhead">双离合变速器(DSG/DCT)部件：</h6>
          <p>
            变速器壳体总成；机电控制模块（或机电控制单元、电子液压控制单元等名称）；双离合器总成（干式、湿式）；齿轮箱内部的润滑部件包含：主动齿轮、从动齿轮（齿轮副组）、主减速器齿轮组、差速器、内部的各种轴和轴承及轴衬、换挡拨叉及其组件、同步器及其组件、档位活动套、止推垫片、导流板及内部油管。</p>
          <p class="remark">备注：自动变速器控制单元只有内置变速箱体内，才属于保修范围内的部件。以上两大部件，只有在修复和更换部件的组件费用超过整个组件总成本的情况下，才能更换总成。</p>

          <h5 class="small-title">(二) 不被保修部分如下：</h5>
          <p>凡没有在“被保修部件”中列明的零部件，或虽然被列明但并非是由车辆制造商或其授权特约维修商提供并安装在车辆上的零部件，均不属于保修方案的被保修零部件，包括但不限于：</p>
          <ul>
            <li>1．车辆出厂标准配置以外的任何改装、加装或零部件的变更；</li>
            <li>2．保养件：根据生产厂家规定的周期性的保养所需更换的零部件及油液，包括但不限于更换滤清器、制动片或制动盘（鼓）、灯泡、雨刮片、轮胎、皮带等保养项目；</li>
            <li>3. 易损件：包括但不限于：轮圈、电池、火花塞、密封件、橡胶类部件、喷油嘴、减震器、玻璃、三元催化器、软件系统等常用易损件；</li>
            <li>4. 人为、外力、噪音、油和液等流体渗漏、机油损耗（机油损耗量根据各品牌生产厂家规定的标准执行）等情况。</li>
            <li>5. 所有电力驱动或者混合动力系统零部件。</li>
          </ul>

          <h5 class="main-title">二、不论哪一种保修计划，下列情形和事项下均不能获得延长保修服务：</h5>
          <h5 class="small-title">(一) 由于以下情形直接或间接导致车辆零部件（即使是被保修的零部件）发生故障：</h5>
          <h6 class="subhead">1、车辆驾驶人员未遵守保修（保养）手册中的有关操作规定，不当使用车辆，或者超出操作或使用限制范围，过度使用车辆，包括但不限于：</h6>
          <ul>
            <li>1）在车辆缺乏必要数量的冷却液或润滑油，或者仪表显示冷却液或润滑油已经过热或不足等情况下，继续驾驶车辆；</li>
            <li>2）使用与车辆制造商规定不符、不合格或者与车主手册中的规定不匹配的燃料、润滑油等油、液；</li>
            <li>3）拖拽重量超过车辆自身重量60%的其它车辆等；</li>
          </ul>
          <h6 class="subhead">2、车辆实际驾驶人员在离开车辆时，没有主动或监督门窗、车顶自动关闭系统关闭天窗、车窗、车门、或活动式车顶；</h6>
          <h6 class="subhead">3、车辆实际使用者在非约定车辆维修商处维修或者保养车辆，因维修或保养不当导致的故障；</h6>
          <h6 class="subhead">4、由于不被保修的零部件发生故障导致被保修的零部件发生损坏；</h6>
          <h6 class="subhead">5、车辆涉水行驶，发生交通事故，被外界物体撞击，自燃；</h6>
          <h6 class="subhead">6、火灾、爆炸、空中运行物体坠落、音爆；</h6>
          <h6 class="subhead">7、战争、敌对行为、军事行为、恐怖主义行为、武装冲突、罢工、民众骚乱、暴动；</h6>
          <h6 class="subhead">8、盗窃、抢劫、抢夺、诈骗行为；</h6>
          <h6 class="subhead">9、核爆炸、核反应、核辐射、放射性污染；</h6>
          <h6 class="subhead">10、地震、海啸、飓风、暴雨、洪水、雷击、火山爆发、地下火、龙卷风、暴风、冰雹等自然灾害；</h6>
          <h6 class="subhead">11、烟熏、大气、土地、水污染及其他污染；</h6>
          <h6 class="subhead">12、动物、昆虫侵入或啃咬；</h6>

          <h5 class="small-title">(二) 只要发生以下情况，无论任何原因导致车辆零部件（即使是被保修的零部件）发生故障，都不能获得延长保修服务：</h5>
          <h6 class="subhead">1、被延保车辆的发动机号码、车辆识别代号等车辆相关信息与延保服务合同中所记载的不符，或者已经被涂改；</h6>
          <h6 class="subhead">2、要求提供延保维修服务时，延长保修服务合同的服务期限尚未开始或者已经终止；</h6>
          <h6 class="subhead">3、车辆实际使用者没有按照延长保修服务合同的约定，对于车辆进行定期保养、故障维修或意外损坏修复；</h6>
          <h6 class="subhead">4、车辆被改装，不符合车辆制造商原厂规格，包括但不限于：改装或加装进排气系统零部件，改装或加装燃油系统零部件、软件变更等；</h6>
          <h6 class="subhead">5、除非符合车辆制造商原设计目的，车辆被用于竞赛、赛车前导、越野等用途；或者被用于租赁、作为出租车/计程车、教练车、配送或快递车辆等任何以盈利为目的的商业用途；</h6>
          <h6 class="subhead">6、车辆被用于公共服务(包括但不限于：警车、消防车、救护车、救助车或者军用车等)用途；</h6>
          <h6 class="subhead">7、车辆被用于非制造商原设计目的；</h6>
          <h6 class="subhead">8、车辆被政府有关当局没收、征用，或者其它类似事件使您对于车辆失去了控制；</h6>
          <h6 class="subhead">9、车辆在中国大陆（不包括香港、澳门、台湾）以外的任何地区；</h6>
          <h6 class="subhead">10、车辆的里程表失效而未被及时（48小时内）恢复，里程表连接被拆除或未连接，或者里程表读数被调整过；</h6>
          <h6 class="subhead">11、车辆实际使用者在车辆出现故障后，故意破坏其原始状态，造成故障无法被检测、鉴定、或评估；</h6>
          <h6 class="subhead">12、车辆实际使用者在车辆出现故障后，恶意夸大损失，提供不真实的证明材料，或企图使用欺诈手段谋取利益；</h6>
          <h6 class="subhead">13、车辆行驶证被吊销或者没有登记，以及车辆未按照法规检验或检验不合格。</h6>

          <h5 class="small-title">(三) 以下费用或损失，或由于以下情况引起的费用或损失，不属于延长保修服务内容，本公司不予承担：</h5>
          <h6 class="subhead">1、按照延长保修服务合同的约定，对于车辆进行定期保养所引起的费用；</h6>
          <h6 class="subhead">2、维修或更换非保修零部件所引起的费用；</h6>
          <h6 class="subhead">3、与被保修零部件无关的任何维护、保养、检测、调试、调整、或校正，包括但不限于：轮胎动平衡、车门窗密闭性校正等；</h6>
          <h6 class="subhead">4、被保修零部件仅需清洗即可恢复正常工作时的拆装和清洗等费用；</h6>
          <h6 class="subhead">5、单独车轮定位（在对被保修零部件提供延长保修服务的过程中必须进行的除外）；</h6>
          <h6 class="subhead">6、生锈、侵蚀、霉变；</h6>
          <h6 class="subhead">7、车辆没有发生故障，单纯以提高车辆的工作性能或舒适性为目的的维修所引起的费用。这种维修包括但不限于：</h6>
          <ul>
            <li>1）单纯为了提高发动机的压缩比或减少油耗，而对发动机缸体或活塞环进行的修理或更换；</li>
            <li>2）单纯为了降低车内噪音，而在车辆上添加隔音材料等；</li>
          </ul>
          <h6 class="subhead">8、延保服务合同签署时，车辆已经存在的故障所引起的维修费用；</h6>
          <h6 class="subhead">9、在车辆已经发生故障的情况下，继续行驶，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">10、在车辆已经发生故障的情况下，不及时（24小时内）向我们报告，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">11、车辆被召回维修所引起的费用；</h6>
          <h6 class="subhead">12、在维修车辆故障时，车辆内遗留的任何财/物的损失；</h6>
          <h6 class="subhead">13、车辆发生故障，或在维修期间不能使用，所引起的任何直接、间接、或衍生性费用或损失，包括但不限于：</h6>
          <ul>
            <li>1）驾乘人员或第三者的人身伤亡、财产损失、收入损失、商业利益损失、时间损失、不方便、不舒适；</li>
            <li>2）因延误、滞留、或车辆不能使用引起的通讯费、电话费、食宿费、租车费、燃料费、交通费、差旅费；</li>
            <li>2）因违反性能、时间、效率、或质量的保证所遭受的罚款等；</li>
          </ul>
          <p class="remark">注意：在车辆须经拆解才可以进行故障检测、鉴定、或评估的情况下，若拆解后发现故障不符合提供延长保修服务的条件时，拆解车辆的费用。</p>
          <h6 class="subhead">14、车辆发生故障后，车辆实际使用者在没有经过我们书面同意的情况下，对于车辆进行维修所引起的任何费用或损失；</h6>
          <h6 class="subhead">15、经国家质量技术监督检验机构或第三方专业技术机构鉴定，被延保车辆存在由于涉及制造等方面的原因而在某一批次、型号或类别的机动车辆中普遍存在的具有同一性的质量问题；</h6>
          <h6 class="subhead">16、任何原因导致的车辆价值降低损失；</h6>
          <h6 class="subhead">17、在延保合同项下的维修，已经由生产商的质保期或者其他服务合同，质量担保，机械故障保险，或维修机构担保涵盖的索赔。</h6>
        </div>
      </div>
      <div class="btn-close" @click="scopeStatus2 = false"></div>
    </div>
    <!--三大件-->
    <div v-show="scopeStatus3" class="scope-window">
      <div class="box">
        <h3 class="title">延保产品范围</h3>
        <div class="content-wrap">
          <p class="start-text">
            本延长保修服务合约若承保车辆的零部件因材料质量和制造工艺有关的缺陷（不包含厂家召回的情形）在延长保修期内出现了故障，我们将为您承担维修费用，最高维修费用为您购买本服务合约产品中约定的赔付限额。本服务合约产品有以下保修部件范围可以选择投保：</p>
          <h5 class="main-title">一、三大件：发动机+变速箱+传动系统</h5>
          <h5 class="small-title">(一) 被保修部分如下：</h5>
          <h6 class="subhead">1、发动机部分</h6>
          <p>包括气缸盖部分、正时部分、气缸体部分。</p>
          <h6 class="subhead">气缸盖部分：</h6>
          <p>
            气缸盖、气门室盖、气门室盖分油板、气缸盖衬垫、凸轮轴瓦盖、凸轮轴瓦架、凸轮偏心轴瓦盖、凸轮偏心轴瓦架、凸轮轴瓦、凸轮轴、偏心轴、进气门、排气门、气门导管、气门弹簧及弹簧座、气门锁片、气门挺柱、气门挺杆、气门推杆、气门摇臂、气门摇臂轴、气门摇臂衬套、气门间隙调整螺钉。</p>

          <h6 class="subhead">正时部分：</h6>
          <p>
            金属材质的时规盖、金属材质的正时链条外罩、正时齿轮、正时链轮、正时链条、正时链条涨紧轮、正时链条涨紧器、正时链条导板、正时皮带（保修前提：车主按车辆制造商要求进行了定期更换）、正时皮带涨紧轮、正时皮带涨紧器、凸轮轴齿盘（可变配气相位机构）、可变配气相位机械执行机构。</p>

          <h6 class="subhead">气缸体部分：</h6>
          <p>
            气缸体、曲轴箱、缸套、活塞、活塞环、活塞销、活塞销卡圈、连杆、连杆瓦、连杆瓦盖、曲轴、曲轴瓦、曲轴链轮、止推瓦、曲轴瓦盖、曲轴瓦架、平衡轴、平衡轴齿轮、平衡轴瓦、机油滤清器支座、机油集滤器及滤网、机油泵、机油泵链轮、机油泵链条。</p>

          <h6 class="subhead">2、变速器部分</h6>
          <p>包括机械部件和附件。</p>
          <h6 class="subhead">手动变速器(MT)部件：</h6>
          <p>
            变速箱壳体总成；变速器箱本体内的润滑部件包含：各齿轮、同步器、锁环、外锥环、输入轴、输出轴、中间轴、换档杆轴、换挡拨叉、换挡机构盖、主减速器齿轮组、差速器、各种轴承/轴衬（推力轴承、滚珠轴承、滚柱轴承、锥轴承等）。</p>

          <h6 class="subhead">自动换挡式手动变速器(AMT/EMT)部件：</h6>
          <p>
            变速器壳体总成；离合器液压驱动总成；变速器箱本体内的润滑部件包含：各齿轮、同步器、锁环、外锥环、输入轴、输出轴、中间轴、倒档轴、主减速器、差速器、各种轴承/轴衬（推力轴承、滚珠轴承、滚柱轴承、锥轴承等）、换档杆轴、换档齿轮、换挡蜗轮、换挡棘轮、选档槽、选档拨叉。</p>

          <h6 class="subhead">自动变速器(AT)部件：</h6>
          <p>
            变速器壳体总成；液力变矩器总成；变速器箱本体内的润滑部件包含：主动齿轮、从动齿轮、中间介轮、差速器以及中间差速器、主减速器齿轮组、各种轴承/轴衬(向心轴承、推力轴承、滑动轴承（铜套）、圆锥滚子轴承)、输入轴、输出轴、中间轴、换档杆轴、行星架、太阳轮、齿圈、离合器鼓、离合器支架、离合器摩擦片组、离合器钢片组、离合器活塞、回位弹簧、减震波形片、压盘、卡环、制动带、制动带伺服机构、蓄压器组件。</p>

          <h6 class="subhead">无极自动变速器(CVT)部件：</h6>
          <p>
            变速器壳体总成；液力变矩器、起步离合器（输入轴）；变速器箱本体内的润滑部件包含：主动齿轮、从动齿轮、差速器、主减速器齿轮组、各种轴承/轴衬（向心轴承、推力轴承、滑动轴承（铜套）、圆锥滚子轴承）、输入轴、输出轴、中间轴、换档杆轴、含行星架、太阳轮、齿圈、离合器鼓、离合器支架、离合器摩擦片组、离合器钢片组、离合器活塞、回位弹簧、减震波形片、压盘、卡环等、主动链轮、从动链轮、传动链条/带。</p>

          <h6 class="subhead">双离合变速器(DSG/DCT)部件：</h6>
          <p>
            变速器壳体总成；机电控制模块（或机电控制单元、电子液压控制单元等名称）；双离合器总成（干式、湿式）；齿轮箱内部的润滑部件包含：主动齿轮、从动齿轮（齿轮副组）、主减速器齿轮组、差速器、内部的各种轴和轴承及轴衬、换挡拨叉及其组件、同步器及其组件、档位活动套、止推垫片、导流板及内部油管。</p>
          <p class="remark">备注：自动变速器控制单元只有内置变速箱体内，才属于保修范围内的部件。</p>

          <h6 class="subhead">3.传动系统部件：指从变速器输出轴至驱动轴外等速万向节止的动力传动零部件</h6>
          <p>
            传动装置包含：前驱半轴、万向节、驱动轴、驱动轴油封、驱动轴中间支架、中间支承轴承；后驱动桥壳，后驱动桥本体内部的润滑部件包含：主减速器齿轮组、轴承、轴衬、差速器、机械差速器锁（桥间锁止机构）、防滑差速离合器、后桥半轴；
            中央分动箱壳、中央分动箱本体内部的润滑部件包含：主动齿轮、从动齿轮、传动轴、传动链条、传动齿轮、多片式离合器；四轮驱动部件包含：锁止式轮毂总成。</p>
          <p class="remark">备注：以上三大部件，只有在修复和更换部件的组件费用超过整个组件总成本的情况下，才能更换总成。</p>

          <h5 class="small-title">(二) 不被保修部分如下：</h5>
          <p>凡没有在“被保修部件”中列明的零部件，或虽然被列明但并非是由车辆制造商或其授权特约维修商提供并安装在车辆上的零部件，均不属于保修方案的被保修零部件，包括但不限于：</p>
          <ul>
            <li>1．车辆出厂标准配置以外的任何改装、加装或零部件的变更；</li>
            <li>2．保养件：根据生产厂家规定的周期性的保养所需更换的零部件及油液，包括但不限于更换滤清器、制动片或制动盘（鼓）、灯泡、雨刮片、轮胎、皮带等保养项目；</li>
            <li>3. 易损件：包括但不限于：轮圈、电池、火花塞、密封件、橡胶类部件、喷油嘴、减震器、玻璃、三元催化器、软件系统等常用易损件；</li>
            <li>4. 人为、外力、噪音、油和液等流体渗漏、机油损耗（机油损耗量根据各品牌生产厂家规定的标准执行）等情况。</li>
            <li>5. 所有电力驱动或者混合动力系统零部件。</li>
          </ul>

          <h5 class="main-title">二、不论哪一种保修计划，下列情形和事项下均不能获得延长保修服务：</h5>
          <h5 class="small-title">(一) 由于以下情形直接或间接导致车辆零部件（即使是被保修的零部件）发生故障：</h5>
          <h6 class="subhead">1、车辆驾驶人员未遵守保修（保养）手册中的有关操作规定，不当使用车辆，或者超出操作或使用限制范围，过度使用车辆，包括但不限于：</h6>
          <ul>
            <li>1）在车辆缺乏必要数量的冷却液或润滑油，或者仪表显示冷却液或润滑油已经过热或不足等情况下，继续驾驶车辆；</li>
            <li>2）使用与车辆制造商规定不符、不合格或者与车主手册中的规定不匹配的燃料、润滑油等油、液；</li>
            <li>3）拖拽重量超过车辆自身重量60%的其它车辆等；</li>
          </ul>
          <h6 class="subhead">2、车辆实际驾驶人员在离开车辆时，没有主动或监督门窗、车顶自动关闭系统关闭天窗、车窗、车门、或活动式车顶；</h6>
          <h6 class="subhead">3、车辆实际使用者在非约定车辆维修商处维修或者保养车辆，因维修或保养不当导致的故障；</h6>
          <h6 class="subhead">4、由于不被保修的零部件发生故障导致被保修的零部件发生损坏；</h6>
          <h6 class="subhead">5、车辆涉水行驶，发生交通事故，被外界物体撞击，自燃；</h6>
          <h6 class="subhead">6、火灾、爆炸、空中运行物体坠落、音爆；</h6>
          <h6 class="subhead">7、战争、敌对行为、军事行为、恐怖主义行为、武装冲突、罢工、民众骚乱、暴动；</h6>
          <h6 class="subhead">8、盗窃、抢劫、抢夺、诈骗行为；</h6>
          <h6 class="subhead">9、核爆炸、核反应、核辐射、放射性污染；</h6>
          <h6 class="subhead">10、地震、海啸、飓风、暴雨、洪水、雷击、火山爆发、地下火、龙卷风、暴风、冰雹等自然灾害；</h6>
          <h6 class="subhead">11、烟熏、大气、土地、水污染及其他污染；</h6>
          <h6 class="subhead">12、动物、昆虫侵入或啃咬；</h6>

          <h5 class="small-title">(二) 只要发生以下情况，无论任何原因导致车辆零部件（即使是被保修的零部件）发生故障，都不能获得延长保修服务：</h5>
          <h6 class="subhead">1、被延保车辆的发动机号码、车辆识别代号等车辆相关信息与延保服务合同中所记载的不符，或者已经被涂改；</h6>
          <h6 class="subhead">2、要求提供延保维修服务时，延长保修服务合同的服务期限尚未开始或者已经终止；</h6>
          <h6 class="subhead">3、车辆实际使用者没有按照延长保修服务合同的约定，对于车辆进行定期保养、故障维修或意外损坏修复；</h6>
          <h6 class="subhead">4、车辆被改装，不符合车辆制造商原厂规格，包括但不限于：改装或加装进排气系统零部件，改装或加装燃油系统零部件、软件变更等；</h6>
          <h6 class="subhead">5、除非符合车辆制造商原设计目的，车辆被用于竞赛、赛车前导、越野等用途；或者被用于租赁、作为出租车/计程车、教练车、配送或快递车辆等任何以盈利为目的的商业用途；</h6>
          <h6 class="subhead">6、车辆被用于公共服务(包括但不限于：警车、消防车、救护车、救助车或者军用车等)用途；</h6>
          <h6 class="subhead">7、车辆被用于非制造商原设计目的；</h6>
          <h6 class="subhead">8、车辆被政府有关当局没收、征用，或者其它类似事件使您对于车辆失去了控制；</h6>
          <h6 class="subhead">9、车辆在中国大陆（不包括香港、澳门、台湾）以外的任何地区；</h6>
          <h6 class="subhead">10、车辆的里程表失效而未被及时（48小时内）恢复，里程表连接被拆除或未连接，或者里程表读数被调整过；</h6>
          <h6 class="subhead">11、车辆实际使用者在车辆出现故障后，故意破坏其原始状态，造成故障无法被检测、鉴定、或评估；</h6>
          <h6 class="subhead">12、车辆实际使用者在车辆出现故障后，恶意夸大损失，提供不真实的证明材料，或企图使用欺诈手段谋取利益；</h6>
          <h6 class="subhead">13、车辆行驶证被吊销或者没有登记，以及车辆未按照法规检验或检验不合格。</h6>

          <h5 class="small-title">(三) 以下费用或损失，或由于以下情况引起的费用或损失，不属于延长保修服务内容，本公司不予承担：</h5>
          <h6 class="subhead">1、按照延长保修服务合同的约定，对于车辆进行定期保养所引起的费用；</h6>
          <h6 class="subhead">2、维修或更换非保修零部件所引起的费用；</h6>
          <h6 class="subhead">3、与被保修零部件无关的任何维护、保养、检测、调试、调整、或校正，包括但不限于：轮胎动平衡、车门窗密闭性校正等；</h6>
          <h6 class="subhead">4、被保修零部件仅需清洗即可恢复正常工作时的拆装和清洗等费用；</h6>
          <h6 class="subhead">5、单独车轮定位（在对被保修零部件提供延长保修服务的过程中必须进行的除外）；</h6>
          <h6 class="subhead">6、生锈、侵蚀、霉变；</h6>
          <h6 class="subhead">7、车辆没有发生故障，单纯以提高车辆的工作性能或舒适性为目的的维修所引起的费用。这种维修包括但不限于：</h6>
          <ul>
            <li>1）单纯为了提高发动机的压缩比或减少油耗，而对发动机缸体或活塞环进行的修理或更换；</li>
            <li>2）单纯为了降低车内噪音，而在车辆上添加隔音材料等；</li>
          </ul>
          <h6 class="subhead">8、延保服务合同签署时，车辆已经存在的故障所引起的维修费用；</h6>
          <h6 class="subhead">9、在车辆已经发生故障的情况下，继续行驶，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">10、在车辆已经发生故障的情况下，不及时（24小时内）向我们报告，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">11、车辆被召回维修所引起的费用；</h6>
          <h6 class="subhead">12、在维修车辆故障时，车辆内遗留的任何财/物的损失；</h6>
          <h6 class="subhead">13、车辆发生故障，或在维修期间不能使用，所引起的任何直接、间接、或衍生性费用或损失，包括但不限于：</h6>
          <ul>
            <li>1）驾乘人员或第三者的人身伤亡、财产损失、收入损失、商业利益损失、时间损失、不方便、不舒适；</li>
            <li>2）因延误、滞留、或车辆不能使用引起的通讯费、电话费、食宿费、租车费、燃料费、交通费、差旅费；</li>
            <li>2）因违反性能、时间、效率、或质量的保证所遭受的罚款等；</li>
          </ul>
          <p class="remark">注意：在车辆须经拆解才可以进行故障检测、鉴定、或评估的情况下，若拆解后发现故障不符合提供延长保修服务的条件时，拆解车辆的费用。</p>
          <h6 class="subhead">14、车辆发生故障后，车辆实际使用者在没有经过我们书面同意的情况下，对于车辆进行维修所引起的任何费用或损失；</h6>
          <h6 class="subhead">15、经国家质量技术监督检验机构或第三方专业技术机构鉴定，被延保车辆存在由于涉及制造等方面的原因而在某一批次、型号或类别的机动车辆中普遍存在的具有同一性的质量问题；</h6>
          <h6 class="subhead">16、任何原因导致的车辆价值降低损失；</h6>
          <h6 class="subhead">17、在延保合同项下的维修，已经由生产商的质保期或者其他服务合同，质量担保，机械故障保险，或维修机构担保涵盖的索赔。</h6>
        </div>
      </div>
      <div class="btn-close" @click="scopeStatus3 = false"></div>
    </div>
    <!--六大系统-->
    <div v-show="scopeStatus4" class="scope-window">
      <div class="box">
        <h3 class="title">延保产品范围</h3>
        <div class="content-wrap">
          <p class="start-text">
            本延长保修服务合约若承保车辆的零部件因材料质量和制造工艺有关的缺陷（不包含厂家召回的情形）在延长保修期内出现了故障，我们将为您承担维修费用，最高维修费用为您购买本服务合约产品中约定的赔付限额。本服务合约产品有以下保修部件范围可以选择投保：</p>
          <h5 class="main-title">一、六大件：六大系统</h5>
          <h5 class="small-title">(一) 被保修部分如下：</h5>
          <h6 class="subhead">1、发动机部分</h6>
          <p>包括气缸盖部分、正时部分、气缸体部分。</p>
          <h6 class="subhead">气缸盖部分：</h6>
          <p>
            气缸盖、气门室盖、气门室盖分油板、气缸盖衬垫、凸轮轴瓦盖、凸轮轴瓦架、凸轮偏心轴瓦盖、凸轮偏心轴瓦架、凸轮轴瓦、凸轮轴、偏心轴、进气门、排气门、气门导管、气门弹簧及弹簧座、气门锁片、气门挺柱、气门挺杆、气门推杆、气门摇臂、气门摇臂轴、气门摇臂衬套、气门间隙调整螺钉。</p>

          <h6 class="subhead">正时部分：</h6>
          <p>
            金属材质的时规盖、金属材质的正时链条外罩、正时齿轮、正时链轮、正时链条、正时链条涨紧轮、正时链条涨紧器、正时链条导板、正时皮带（保修前提：车主按车辆制造商要求进行了定期更换）、正时皮带涨紧轮、正时皮带涨紧器、凸轮轴齿盘（可变配气相位机构）、可变配气相位机械执行机构。</p>

          <h6 class="subhead">气缸体部分：</h6>
          <p>
            气缸体、曲轴箱、缸套、活塞、活塞环、活塞销、活塞销卡圈、连杆、连杆瓦、连杆瓦盖、曲轴、曲轴瓦、曲轴链轮、止推瓦、曲轴瓦盖、曲轴瓦架、平衡轴、平衡轴齿轮、平衡轴瓦、机油滤清器支座、机油集滤器及滤网、机油泵、机油泵链轮、机油泵链条。</p>

          <h6 class="subhead">2、变速器部分</h6>
          <p>包括机械部件和附件。</p>
          <h6 class="subhead">手动变速器(MT)部件：</h6>
          <p>
            变速箱壳体总成；变速器箱本体内的润滑部件包含：各齿轮、同步器、锁环、外锥环、输入轴、输出轴、中间轴、换档杆轴、换挡拨叉、换挡机构盖、主减速器齿轮组、差速器、各种轴承/轴衬（推力轴承、滚珠轴承、滚柱轴承、锥轴承等）。</p>

          <h6 class="subhead">自动换挡式手动变速器(AMT/EMT)部件：</h6>
          <p>
            变速器壳体总成；离合器液压驱动总成；变速器箱本体内的润滑部件包含：各齿轮、同步器、锁环、外锥环、输入轴、输出轴、中间轴、倒档轴、主减速器、差速器、各种轴承/轴衬（推力轴承、滚珠轴承、滚柱轴承、锥轴承等）、换档杆轴、换档齿轮、换挡蜗轮、换挡棘轮、选档槽、选档拨叉。</p>

          <h6 class="subhead">自动变速器(AT)部件：</h6>
          <p>
            变速器壳体总成；液力变矩器总成；变速器箱本体内的润滑部件包含：主动齿轮、从动齿轮、中间介轮、差速器以及中间差速器、主减速器齿轮组、各种轴承/轴衬(向心轴承、推力轴承、滑动轴承（铜套）、圆锥滚子轴承)、输入轴、输出轴、中间轴、换档杆轴、行星架、太阳轮、齿圈、离合器鼓、离合器支架、离合器摩擦片组、离合器钢片组、离合器活塞、回位弹簧、减震波形片、压盘、卡环、制动带、制动带伺服机构、蓄压器组件。</p>

          <h6 class="subhead">无极自动变速器(CVT)部件：</h6>
          <p>
            变速器壳体总成；液力变矩器、起步离合器（输入轴）；变速器箱本体内的润滑部件包含：主动齿轮、从动齿轮、差速器、主减速器齿轮组、各种轴承/轴衬（向心轴承、推力轴承、滑动轴承（铜套）、圆锥滚子轴承）、输入轴、输出轴、中间轴、换档杆轴、含行星架、太阳轮、齿圈、离合器鼓、离合器支架、离合器摩擦片组、离合器钢片组、离合器活塞、回位弹簧、减震波形片、压盘、卡环等、主动链轮、从动链轮、传动链条/带。</p>

          <h6 class="subhead">双离合变速器(DSG/DCT)部件：</h6>
          <p>
            变速器壳体总成；机电控制模块（或机电控制单元、电子液压控制单元等名称）；双离合器总成（干式、湿式）；齿轮箱内部的润滑部件包含：主动齿轮、从动齿轮（齿轮副组）、主减速器齿轮组、差速器、内部的各种轴和轴承及轴衬、换挡拨叉及其组件、同步器及其组件、档位活动套、止推垫片、导流板及内部油管。</p>
          <p class="remark">备注：自动变速器控制单元只有内置变速箱体内，才属于保修范围内的部件。</p>

          <h6 class="subhead">3、发动机变速箱控制单元</h6>
          <h6 class="subhead">发动机部分：</h6>
          <p>发动机电子控制单元ECU。</p>
          <p>
            发动机信号传感器部件：空气流量计、曲轴位置传感器、发动机转速传感器、进气压力传感器、水温传感器、进气温度传感器、排气温度传感器、节气门位置传感器、凸轮轴位置传感器、霍尔传感器、氧传感器、爆震传感器、机油压力传感器、机油液位传感器、机油温度传感器。</p>
          <p>发动机信号执行器部件：OCV电磁阀。</p>
          <p>点火/起动系统部件：启动机、分电器、点火线圈。</p>
          <p>供电系统部件：发电机。</p>

          <h6 class="subhead">变速器部分：</h6>
          <p>变速器电子控制单元TCU。</p>
          <p>变速器传感器、控制执行器部件：车速传感器、油温传感器、油压传感器、电磁阀、档位开关、变速箱输入轴转速传感器、变速箱输出轴转速传感器。</p>
          <p>巡航控制系统部件：巡航定速开关、巡航控制传感器、巡航控制电机、定速巡航控制拉线、定速巡航控制模块。</p>

          <h6 class="subhead">4、燃油供给系统部件：</h6>
          <p>低压油泵、高压油泵、燃油分配器、金属油管、压力调节器、油轨、燃油箱、燃油位置传感器、燃油蒸汽回收装置。</p>

          <h6 class="subhead">5、进气、排气系统部件：</h6>
          <p>
            节气门体（含电子节气门）、非可变进气歧管、可变进气歧管、可变进气歧管机械执行机构(VIS)、可变进气涡流机械执行机构（VTCS）、可变进气道机械执行机构（VAD）、排气歧管、谐振腔、二次空气泵、废气再循环EGR阀、氧传感器、进气压力传感器、空气流量计、进气温度传感器、节气门位置传感器、油气分离器；
            增压器系统包含：增压器、金属材质的增压管路、增压压力控制阀（电磁）、电控增压空气阀、涡轮增压真空执行器（真空泵）、增压中冷器、机械增压离合器、机械增压皮带轮、旁通阀（泄压阀）、机械压力控制阀。</p>
          <p class="remark">备注：三元催化器与排气歧管一体时，单独三元催化器的损坏不保修。</p>

          <h6 class="subhead">6、冷却系统部件：</h6>
          <p>冷却风扇叶片组、风扇偶合器、水泵、副水泵、散热器、机械式节温器、副水箱（膨胀水箱），冷却风扇电机、电子式节温器、水温控制开关、风扇控制模块。</p>
          <p class="remark">备注：以上6大系统部件，只有在修复和更换部件的组件费用超过整个组件总成本的情况下，才能更换总成。</p>

          <h5 class="small-title">(二) 不被保修部分如下：</h5>
          <p>凡没有在“被保修部件”中列明的零部件，或虽然被列明但并非是由车辆制造商或其授权特约维修商提供并安装在车辆上的零部件，均不属于保修方案的被保修零部件，包括但不限于：</p>
          <ul>
            <li>1．车辆出厂标准配置以外的任何改装、加装或零部件的变更；</li>
            <li>2．保养件：根据生产厂家规定的周期性的保养所需更换的零部件及油液，包括但不限于更换滤清器、制动片或制动盘（鼓）、灯泡、雨刮片、轮胎、皮带等保养项目；</li>
            <li>3. 易损件：包括但不限于：轮圈、电池、火花塞、密封件、橡胶类部件、喷油嘴、减震器、玻璃、三元催化器、软件系统等常用易损件；</li>
            <li>4. 人为、外力、噪音、油和液等流体渗漏、机油损耗（机油损耗量根据各品牌生产厂家规定的标准执行）等情况。</li>
            <li>5. 所有电力驱动或者混合动力系统零部件。</li>
          </ul>

          <h5 class="main-title">二、不论哪一种保修计划，下列情形和事项下均不能获得延长保修服务：</h5>
          <h5 class="small-title">(一) 由于以下情形直接或间接导致车辆零部件（即使是被保修的零部件）发生故障：</h5>
          <h6 class="subhead">1、车辆驾驶人员未遵守保修（保养）手册中的有关操作规定，不当使用车辆，或者超出操作或使用限制范围，过度使用车辆，包括但不限于：</h6>
          <ul>
            <li>1）在车辆缺乏必要数量的冷却液或润滑油，或者仪表显示冷却液或润滑油已经过热或不足等情况下，继续驾驶车辆；</li>
            <li>2）使用与车辆制造商规定不符、不合格或者与车主手册中的规定不匹配的燃料、润滑油等油、液；</li>
            <li>3）拖拽重量超过车辆自身重量60%的其它车辆等；</li>
          </ul>
          <h6 class="subhead">2、车辆实际驾驶人员在离开车辆时，没有主动或监督门窗、车顶自动关闭系统关闭天窗、车窗、车门、或活动式车顶；</h6>
          <h6 class="subhead">3、车辆实际使用者在非约定车辆维修商处维修或者保养车辆，因维修或保养不当导致的故障；</h6>
          <h6 class="subhead">4、由于不被保修的零部件发生故障导致被保修的零部件发生损坏；</h6>
          <h6 class="subhead">5、车辆涉水行驶，发生交通事故，被外界物体撞击，自燃；</h6>
          <h6 class="subhead">6、火灾、爆炸、空中运行物体坠落、音爆；</h6>
          <h6 class="subhead">7、战争、敌对行为、军事行为、恐怖主义行为、武装冲突、罢工、民众骚乱、暴动；</h6>
          <h6 class="subhead">8、盗窃、抢劫、抢夺、诈骗行为；</h6>
          <h6 class="subhead">9、核爆炸、核反应、核辐射、放射性污染；</h6>
          <h6 class="subhead">10、地震、海啸、飓风、暴雨、洪水、雷击、火山爆发、地下火、龙卷风、暴风、冰雹等自然灾害；</h6>
          <h6 class="subhead">11、烟熏、大气、土地、水污染及其他污染；</h6>
          <h6 class="subhead">12、动物、昆虫侵入或啃咬；</h6>

          <h5 class="small-title">(二) 只要发生以下情况，无论任何原因导致车辆零部件（即使是被保修的零部件）发生故障，都不能获得延长保修服务：</h5>
          <h6 class="subhead">1、被延保车辆的发动机号码、车辆识别代号等车辆相关信息与延保服务合同中所记载的不符，或者已经被涂改；</h6>
          <h6 class="subhead">2、要求提供延保维修服务时，延长保修服务合同的服务期限尚未开始或者已经终止；</h6>
          <h6 class="subhead">3、车辆实际使用者没有按照延长保修服务合同的约定，对于车辆进行定期保养、故障维修或意外损坏修复；</h6>
          <h6 class="subhead">4、车辆被改装，不符合车辆制造商原厂规格，包括但不限于：改装或加装进排气系统零部件，改装或加装燃油系统零部件、软件变更等；</h6>
          <h6 class="subhead">5、除非符合车辆制造商原设计目的，车辆被用于竞赛、赛车前导、越野等用途；或者被用于租赁、作为出租车/计程车、教练车、配送或快递车辆等任何以盈利为目的的商业用途；</h6>
          <h6 class="subhead">6、车辆被用于公共服务(包括但不限于：警车、消防车、救护车、救助车或者军用车等)用途；</h6>
          <h6 class="subhead">7、车辆被用于非制造商原设计目的；</h6>
          <h6 class="subhead">8、车辆被政府有关当局没收、征用，或者其它类似事件使您对于车辆失去了控制；</h6>
          <h6 class="subhead">9、车辆在中国大陆（不包括香港、澳门、台湾）以外的任何地区；</h6>
          <h6 class="subhead">10、车辆的里程表失效而未被及时（48小时内）恢复，里程表连接被拆除或未连接，或者里程表读数被调整过；</h6>
          <h6 class="subhead">11、车辆实际使用者在车辆出现故障后，故意破坏其原始状态，造成故障无法被检测、鉴定、或评估；</h6>
          <h6 class="subhead">12、车辆实际使用者在车辆出现故障后，恶意夸大损失，提供不真实的证明材料，或企图使用欺诈手段谋取利益；</h6>
          <h6 class="subhead">13、车辆行驶证被吊销或者没有登记，以及车辆未按照法规检验或检验不合格。</h6>

          <h5 class="small-title">(三) 以下费用或损失，或由于以下情况引起的费用或损失，不属于延长保修服务内容，本公司不予承担：</h5>
          <h6 class="subhead">1、按照延长保修服务合同的约定，对于车辆进行定期保养所引起的费用；</h6>
          <h6 class="subhead">2、维修或更换非保修零部件所引起的费用；</h6>
          <h6 class="subhead">3、与被保修零部件无关的任何维护、保养、检测、调试、调整、或校正，包括但不限于：轮胎动平衡、车门窗密闭性校正等；</h6>
          <h6 class="subhead">4、被保修零部件仅需清洗即可恢复正常工作时的拆装和清洗等费用；</h6>
          <h6 class="subhead">5、单独车轮定位（在对被保修零部件提供延长保修服务的过程中必须进行的除外）；</h6>
          <h6 class="subhead">6、生锈、侵蚀、霉变；</h6>
          <h6 class="subhead">7、车辆没有发生故障，单纯以提高车辆的工作性能或舒适性为目的的维修所引起的费用。这种维修包括但不限于：</h6>
          <ul>
            <li>1）单纯为了提高发动机的压缩比或减少油耗，而对发动机缸体或活塞环进行的修理或更换；</li>
            <li>2）单纯为了降低车内噪音，而在车辆上添加隔音材料等；</li>
          </ul>
          <h6 class="subhead">8、延保服务合同签署时，车辆已经存在的故障所引起的维修费用；</h6>
          <h6 class="subhead">9、在车辆已经发生故障的情况下，继续行驶，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">10、在车辆已经发生故障的情况下，不及时（24小时内）向我们报告，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">11、车辆被召回维修所引起的费用；</h6>
          <h6 class="subhead">12、在维修车辆故障时，车辆内遗留的任何财/物的损失；</h6>
          <h6 class="subhead">13、车辆发生故障，或在维修期间不能使用，所引起的任何直接、间接、或衍生性费用或损失，包括但不限于：</h6>
          <ul>
            <li>1）驾乘人员或第三者的人身伤亡、财产损失、收入损失、商业利益损失、时间损失、不方便、不舒适；</li>
            <li>2）因延误、滞留、或车辆不能使用引起的通讯费、电话费、食宿费、租车费、燃料费、交通费、差旅费；</li>
            <li>2）因违反性能、时间、效率、或质量的保证所遭受的罚款等；</li>
          </ul>
          <p class="remark">注意：在车辆须经拆解才可以进行故障检测、鉴定、或评估的情况下，若拆解后发现故障不符合提供延长保修服务的条件时，拆解车辆的费用。</p>
          <h6 class="subhead">14、车辆发生故障后，车辆实际使用者在没有经过我们书面同意的情况下，对于车辆进行维修所引起的任何费用或损失；</h6>
          <h6 class="subhead">15、经国家质量技术监督检验机构或第三方专业技术机构鉴定，被延保车辆存在由于涉及制造等方面的原因而在某一批次、型号或类别的机动车辆中普遍存在的具有同一性的质量问题；</h6>
          <h6 class="subhead">16、任何原因导致的车辆价值降低损失；</h6>
          <h6 class="subhead">17、在延保合同项下的维修，已经由生产商的质保期或者其他服务合同，质量担保，机械故障保险，或维修机构担保涵盖的索赔。</h6>
        </div>
      </div>
      <div class="btn-close" @click="scopeStatus4 = false"></div>
    </div>
    <!--十一大系统-->
    <div v-show="scopeStatus5" class="scope-window">
      <div class="box">
        <h3 class="title">延保产品范围</h3>
        <div class="content-wrap">
          <p class="start-text">
            本延长保修服务合约若承保车辆的零部件因材料质量和制造工艺有关的缺陷（不包含厂家召回的情形）在延长保修期内出现了故障，我们将为您承担维修费用，最高维修费用为您购买本服务合约产品中约定的赔付限额。本服务合约产品有以下保修部件范围可以选择投保：</p>
          <h5 class="main-title">一、十一大件： 十一大系统</h5>
          <h5 class="small-title">(一) 被保修部分如下：</h5>
          <h6 class="subhead">1、发动机部分</h6>
          <p>包括气缸盖部分、正时部分、气缸体部分。</p>
          <h6 class="subhead">气缸盖部分：</h6>
          <p>
            气缸盖、气门室盖、气门室盖分油板、气缸盖衬垫、凸轮轴瓦盖、凸轮轴瓦架、凸轮偏心轴瓦盖、凸轮偏心轴瓦架、凸轮轴瓦、凸轮轴、偏心轴、进气门、排气门、气门导管、气门弹簧及弹簧座、气门锁片、气门挺柱、气门挺杆、气门推杆、气门摇臂、气门摇臂轴、气门摇臂衬套、气门间隙调整螺钉。</p>

          <h6 class="subhead">正时部分：</h6>
          <p>
            金属材质的时规盖、金属材质的正时链条外罩、正时齿轮、正时链轮、正时链条、正时链条涨紧轮、正时链条涨紧器、正时链条导板、正时皮带（保修前提：车主按车辆制造商要求进行了定期更换）、正时皮带涨紧轮、正时皮带涨紧器、凸轮轴齿盘（可变配气相位机构）、可变配气相位机械执行机构。</p>

          <h6 class="subhead">气缸体部分：</h6>
          <p>
            气缸体、曲轴箱、缸套、活塞、活塞环、活塞销、活塞销卡圈、连杆、连杆瓦、连杆瓦盖、曲轴、曲轴瓦、曲轴链轮、止推瓦、曲轴瓦盖、曲轴瓦架、平衡轴、平衡轴齿轮、平衡轴瓦、机油滤清器支座、机油集滤器及滤网、机油泵、机油泵链轮、机油泵链条。</p>

          <h6 class="subhead">2、变速器部分</h6>
          <p>包括机械部件和附件。</p>
          <h6 class="subhead">手动变速器(MT)部件：</h6>
          <p>
            变速箱壳体总成；变速器箱本体内的润滑部件包含：各齿轮、同步器、锁环、外锥环、输入轴、输出轴、中间轴、换档杆轴、换挡拨叉、换挡机构盖、主减速器齿轮组、差速器、各种轴承/轴衬（推力轴承、滚珠轴承、滚柱轴承、锥轴承等）。</p>

          <h6 class="subhead">自动换挡式手动变速器(AMT/EMT)部件：</h6>
          <p>
            变速器壳体总成；离合器液压驱动总成；变速器箱本体内的润滑部件包含：各齿轮、同步器、锁环、外锥环、输入轴、输出轴、中间轴、倒档轴、主减速器、差速器、各种轴承/轴衬（推力轴承、滚珠轴承、滚柱轴承、锥轴承等）、换档杆轴、换档齿轮、换挡蜗轮、换挡棘轮、选档槽、选档拨叉。</p>

          <h6 class="subhead">自动变速器(AT)部件：</h6>
          <p>
            变速器壳体总成；液力变矩器总成；变速器箱本体内的润滑部件包含：主动齿轮、从动齿轮、中间介轮、差速器以及中间差速器、主减速器齿轮组、各种轴承/轴衬(向心轴承、推力轴承、滑动轴承（铜套）、圆锥滚子轴承)、输入轴、输出轴、中间轴、换档杆轴、行星架、太阳轮、齿圈、离合器鼓、离合器支架、离合器摩擦片组、离合器钢片组、离合器活塞、回位弹簧、减震波形片、压盘、卡环、制动带、制动带伺服机构、蓄压器组件。</p>

          <h6 class="subhead">无极自动变速器(CVT)部件：</h6>
          <p>
            变速器壳体总成；液力变矩器、起步离合器（输入轴）；变速器箱本体内的润滑部件包含：主动齿轮、从动齿轮、差速器、主减速器齿轮组、各种轴承/轴衬（向心轴承、推力轴承、滑动轴承（铜套）、圆锥滚子轴承）、输入轴、输出轴、中间轴、换档杆轴、含行星架、太阳轮、齿圈、离合器鼓、离合器支架、离合器摩擦片组、离合器钢片组、离合器活塞、回位弹簧、减震波形片、压盘、卡环等、主动链轮、从动链轮、传动链条/带。</p>

          <h6 class="subhead">双离合变速器(DSG/DCT)部件：</h6>
          <p>
            变速器壳体总成；机电控制模块（或机电控制单元、电子液压控制单元等名称）；双离合器总成（干式、湿式）；齿轮箱内部的润滑部件包含：主动齿轮、从动齿轮（齿轮副组）、主减速器齿轮组、差速器、内部的各种轴和轴承及轴衬、换挡拨叉及其组件、同步器及其组件、档位活动套、止推垫片、导流板及内部油管。</p>
          <p class="remark">备注：自动变速器控制单元只有内置变速箱体内，才属于保修范围内的部件。</p>

          <h6 class="subhead">3、传动系统部件：指从变速器输出轴至驱动轴外等速万向节止的动力传动零部件</h6>
          <p>
            传动装置包含：前驱半轴、万向节、驱动轴、驱动轴油封、驱动轴中间支架、中间支承轴承；后驱动桥壳，后驱动桥本体内部的润滑部件包含：主减速器齿轮组、轴承、轴衬、差速器、机械差速器锁（桥间锁止机构）、防滑差速离合器、后桥半轴；
            中央分动箱壳、中央分动箱本体内部的润滑部件包含：主动齿轮、从动齿轮、传动轴、传动链条、传动齿轮、多片式离合器；四轮驱动部件包含：锁止式轮毂总成。</p>

          <h6 class="subhead">4、电器系统部件</h6>
          <h6 class="subhead">发动机部分：</h6>
          <p>发动机电子控制单元ECU。</p>
          <p>
            发动机信号传感器部件：空气流量计、曲轴位置传感器、发动机转速传感器、进气压力传感器、水温传感器、进气温度传感器、排气温度传感器、节气门位置传感器、凸轮轴位置传感器、霍尔传感器、氧传感器、爆震传感器、机油压力传感器、机油液位传感器、机油温度传感器。</p>
          <p>发动机信号执行器部件：OCV电磁阀。</p>
          <p>点火/起动系统部件：启动机、分电器、点火线圈。</p>
          <p>供电系统部件：发电机。</p>

          <h6 class="subhead">变速器部分：</h6>
          <p>变速器电子控制单元TCU。</p>
          <p>变速器传感器、控制执行器部件：车速传感器、油温传感器、油压传感器、电磁阀、档位开关、变速箱输入轴转速传感器、变速箱输出轴转速传感器。</p>
          <p>巡航控制系统部件：巡航定速开关、巡航控制传感器、巡航控制电机、定速巡航控制拉线、定速巡航控制模块。</p>

          <h6 class="subhead">车身电气部分：</h6>
          <p>灯光信号系统部件：示宽灯开关、大灯开关、大灯变光开关、雾灯开关、转向灯开关、警告灯开关、大灯清洗开关、仪表照明调节开关、大灯调节电机、大灯高度调节开关、制动灯开关、倒档开关。</p>
          <p>汽车仪表系统部件：组合式仪表总成。</p>
          <p>雨刷清洗系统部件：雨刮开关（含清洗）、自动刮水器控制开关、雨刮电机、雨刮清洗电机、雨量传感器；</p>
          <p>中控锁系统部件：中控锁开关、各门开关、后备箱开关、油箱盖电动开关、门锁电机。</p>
          <p>乘客安全保护系统部件：碰撞传感器、安全气囊、气囊卷簧、SRS控制单元、安全带、安全头枕（包含因故障引爆后可能需要更换的仪表板、线束）。</p>
          <p>电动座椅调整系统部件：电动座椅开关、电动座椅记忆开关、电动座椅电机。</p>
          <p>车身水平控制部件：传感器，高度控制阀，空气泵，动态底盘控制单元。</p>
          <p>电动后视镜部件：电动后视镜开关、后视镜折叠开关、电动后视镜电机。</p>
          <p>电动车窗和天窗部件：电动车窗开关、电动天窗开关、电动车窗电机、天窗电机。</p>
          <p class="remark">备注：开关故障仅限于可操作开关的功能性故障，不包括物理性损坏。</p>

          <h6 class="subhead">5、燃油供给系统部件</h6>
          <p>低压油泵、高压油泵、燃油分配器、金属油管、压力调节器、油轨、燃油箱、燃油位置传感器、燃油蒸汽回收装置。</p>

          <h6 class="subhead">6、进气、排气系统部件</h6>
          <p>
            节气门体（含电子节气门）、非可变进气歧管、可变进气歧管、可变进气歧管机械执行机构(VIS)、可变进气涡流机械执行机构（VTCS）、可变进气道机械执行机构（VAD）、排气歧管、谐振腔、二次空气泵、废气再循环EGR阀、氧传感器、进气压力传感器、空气流量计、进气温度传感器、节气门位置传感器、油气分离器；
            增压器系统包含：增压器、金属材质的增压管路、增压压力控制阀（电磁）、电控增压空气阀、涡轮增压真空执行器（真空泵）、增压中冷器、机械增压离合器、机械增压皮带轮、旁通阀（泄压阀）、机械压力控制阀。</p>
          <p class="remark">备注：三元催化器与排气歧管一体时，单独三元催化器的损坏不保修。</p>

          <h6 class="subhead">7、冷却系统部件</h6>
          <p>冷却风扇叶片组、风扇偶合器、水泵、副水泵、散热器、机械式节温器、副水箱（膨胀水箱），冷却风扇电机、电子式节温器、水温控制开关、风扇控制模块。</p>

          <h6 class="subhead">8、空调系统部件</h6>
          <p>
            压缩机（不含离合器）、压缩机离合器、冷凝器、蒸发器、暖风水箱、支架系统、干燥器、高／低压力管、膨胀阀，高压压力传感器、低压压力传感器、室外温度传感器、室内温度传感器、鼓风机、空调伺服电机、空调开关、空调控制面板、空调控制模块。</p>

          <h6 class="subhead">9、制动系统部件</h6>
          <p>制动总泵、制动分泵、制动轮缸、组合阀、真空助力器、机械真空泵、制动力分配阀、液压制动管路以及固定件、制动踏板及支架、驻车制动器拉线；</p>
          <p>防抱死制动系统：液压控制单元、电子控制单元、车轮转速传感器、液压泵总成、蓄压器、偏摆率传感器、加速度传感器、制动压力调节器；</p>
          <p>电子驻车制动系统：电子驻车制动器拉线、电子驻车开关、电子驻车泵、电子驻车系统电机、电子驻车控制单元。</p>

          <h6 class="subhead">10、制动系统部件</h6>
          <p>压力轴承、转向节、控制臂、导向臂、连接杆、球头、横向稳定杆（平衡杆）、副车架（元宝梁）、减震器弹簧（含扭杆弹簧）。</p>

          <h6 class="subhead">11、转向系统部件</h6>
          <p>
            转向管柱、转向轴、转向连接杆、机械式转向机、电子转向机、液压转向泵（非电子）、电子液压转向泵、皮带轮、动力转向油管、转向摇臂、转向节臂、转向纵拉杆、拉杆外球头、储液罐、转向助力油冷却器、转向助力压力传感器、方向盘转角传感器；</p>
          <p class="remark">备注：以上11大系统部件，只有在修复和更换部件的组件费用超过整个组件总成本的情况下，才能更换总成。</p>

          <h5 class="small-title">(二) 不被保修部分如下：</h5>
          <p>凡没有在“被保修部件”中列明的零部件，或虽然被列明但并非是由车辆制造商或其授权特约维修商提供并安装在车辆上的零部件，均不属于保修方案的被保修零部件，包括但不限于：</p>
          <ul>
            <li>1．车辆出厂标准配置以外的任何改装、加装或零部件的变更；</li>
            <li>2．保养件：根据生产厂家规定的周期性的保养所需更换的零部件及油液，包括但不限于更换滤清器、制动片或制动盘（鼓）、灯泡、雨刮片、轮胎、皮带等保养项目；</li>
            <li>3. 易损件：包括但不限于：轮圈、电池、火花塞、密封件、橡胶类部件、喷油嘴、减震器、玻璃、三元催化器、软件系统等常用易损件；</li>
            <li>4. 人为、外力、噪音、油和液等流体渗漏、机油损耗（机油损耗量根据各品牌生产厂家规定的标准执行）等情况。</li>
            <li>5. 所有电力驱动或者混合动力系统零部件。</li>
          </ul>

          <h5 class="small-title">(三) 在被保障零部件发生保障范围内的故障时，必须遵循的维修原则：</h5>
          <ul>
            <li>1．被保障零部件必须执行修复为主，更换为辅的原则，包括但不限于发动机缸体、缸盖、轴等外加工修复，变速箱修复（外修）等。</li>
            <li>2．被保障零部件只有在修复和更换部件的组件费用超过整个组件总成本的情况下，才能更换总成。</li>
            <li>3. 被保障零部件为进口的，如车辆生产商提供该零部件的国产替代件的情况下，优先采用国产零部件。</li>
            <li>4. 人为、外力、噪音、油和液等流体渗漏、机油损耗（机油损耗量根据各品牌生产厂家规定的标准执行）等情况。</li>
            <li>5. 被保障零部件在车辆生产商提供再制造零部件的情况下，优先采用再制造零部件。</li>
          </ul>

          <h5 class="main-title">二、不论哪一种保修计划，下列情形和事项下均不能获得延长保修服务：</h5>
          <h5 class="small-title">(一) 由于以下情形直接或间接导致车辆零部件（即使是被保修的零部件）发生故障：</h5>
          <h6 class="subhead">1、车辆驾驶人员未遵守保修（保养）手册中的有关操作规定，不当使用车辆，或者超出操作或使用限制范围，过度使用车辆，包括但不限于：</h6>
          <ul>
            <li>1）在车辆缺乏必要数量的冷却液或润滑油，或者仪表显示冷却液或润滑油已经过热或不足等情况下，继续驾驶车辆；</li>
            <li>2）使用与车辆制造商规定不符、不合格或者与车主手册中的规定不匹配的燃料、润滑油等油、液；</li>
            <li>3）拖拽重量超过车辆自身重量60%的其它车辆等；</li>
          </ul>
          <h6 class="subhead">2、车辆实际驾驶人员在离开车辆时，没有主动或监督门窗、车顶自动关闭系统关闭天窗、车窗、车门、或活动式车顶；</h6>
          <h6 class="subhead">3、车辆实际使用者在非约定车辆维修商处维修或者保养车辆，因维修或保养不当导致的故障；</h6>
          <h6 class="subhead">4、由于不被保修的零部件发生故障导致被保修的零部件发生损坏；</h6>
          <h6 class="subhead">5、车辆涉水行驶，发生交通事故，被外界物体撞击，自燃；</h6>
          <h6 class="subhead">6、火灾、爆炸、空中运行物体坠落、音爆；</h6>
          <h6 class="subhead">7、战争、敌对行为、军事行为、恐怖主义行为、武装冲突、罢工、民众骚乱、暴动；</h6>
          <h6 class="subhead">8、盗窃、抢劫、抢夺、诈骗行为；</h6>
          <h6 class="subhead">9、核爆炸、核反应、核辐射、放射性污染；</h6>
          <h6 class="subhead">10、地震、海啸、飓风、暴雨、洪水、雷击、火山爆发、地下火、龙卷风、暴风、冰雹等自然灾害；</h6>
          <h6 class="subhead">11、烟熏、大气、土地、水污染及其他污染；</h6>
          <h6 class="subhead">12、动物、昆虫侵入或啃咬；</h6>

          <h5 class="small-title">(二) 只要发生以下情况，无论任何原因导致车辆零部件（即使是被保修的零部件）发生故障，都不能获得延长保修服务：</h5>
          <h6 class="subhead">1、被延保车辆的发动机号码、车辆识别代号等车辆相关信息与延保服务合同中所记载的不符，或者已经被涂改；</h6>
          <h6 class="subhead">2、要求提供延保维修服务时，延长保修服务合同的服务期限尚未开始或者已经终止；</h6>
          <h6 class="subhead">3、车辆实际使用者没有按照延长保修服务合同的约定，对于车辆进行定期保养、故障维修或意外损坏修复；</h6>
          <h6 class="subhead">4、车辆被改装，不符合车辆制造商原厂规格，包括但不限于：改装或加装进排气系统零部件，改装或加装燃油系统零部件、软件变更等；</h6>
          <h6 class="subhead">5、除非符合车辆制造商原设计目的，车辆被用于竞赛、赛车前导、越野等用途；或者被用于租赁、作为出租车/计程车、教练车、配送或快递车辆等任何以盈利为目的的商业用途；</h6>
          <h6 class="subhead">6、车辆被用于公共服务(包括但不限于：警车、消防车、救护车、救助车或者军用车等)用途；</h6>
          <h6 class="subhead">7、车辆被用于非制造商原设计目的；</h6>
          <h6 class="subhead">8、车辆被政府有关当局没收、征用，或者其它类似事件使您对于车辆失去了控制；</h6>
          <h6 class="subhead">9、车辆在中国大陆（不包括香港、澳门、台湾）以外的任何地区；</h6>
          <h6 class="subhead">10、车辆的里程表失效而未被及时（48小时内）恢复，里程表连接被拆除或未连接，或者里程表读数被调整过；</h6>
          <h6 class="subhead">11、车辆实际使用者在车辆出现故障后，故意破坏其原始状态，造成故障无法被检测、鉴定、或评估；</h6>
          <h6 class="subhead">12、车辆实际使用者在车辆出现故障后，恶意夸大损失，提供不真实的证明材料，或企图使用欺诈手段谋取利益；</h6>
          <h6 class="subhead">13、车辆行驶证被吊销或者没有登记，以及车辆未按照法规检验或检验不合格。</h6>

          <h5 class="small-title">(三) 以下费用或损失，或由于以下情况引起的费用或损失，不属于延长保修服务内容，本公司不予承担：</h5>
          <h6 class="subhead">1、按照延长保修服务合同的约定，对于车辆进行定期保养所引起的费用；</h6>
          <h6 class="subhead">2、维修或更换非保修零部件所引起的费用；</h6>
          <h6 class="subhead">3、与被保修零部件无关的任何维护、保养、检测、调试、调整、或校正，包括但不限于：轮胎动平衡、车门窗密闭性校正等；</h6>
          <h6 class="subhead">4、被保修零部件仅需清洗即可恢复正常工作时的拆装和清洗等费用；</h6>
          <h6 class="subhead">5、单独车轮定位（在对被保修零部件提供延长保修服务的过程中必须进行的除外）；</h6>
          <h6 class="subhead">6、生锈、侵蚀、霉变；</h6>
          <h6 class="subhead">7、车辆没有发生故障，单纯以提高车辆的工作性能或舒适性为目的的维修所引起的费用。这种维修包括但不限于：</h6>
          <ul>
            <li>1）单纯为了提高发动机的压缩比或减少油耗，而对发动机缸体或活塞环进行的修理或更换；</li>
            <li>2）单纯为了降低车内噪音，而在车辆上添加隔音材料等；</li>
          </ul>
          <h6 class="subhead">8、延保服务合同签署时，车辆已经存在的故障所引起的维修费用；</h6>
          <h6 class="subhead">9、在车辆已经发生故障的情况下，继续行驶，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">10、在车辆已经发生故障的情况下，不及时（24小时内）向我们报告，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">11、车辆被召回维修所引起的费用；</h6>
          <h6 class="subhead">12、在维修车辆故障时，车辆内遗留的任何财/物的损失；</h6>
          <h6 class="subhead">13、车辆发生故障，或在维修期间不能使用，所引起的任何直接、间接、或衍生性费用或损失，包括但不限于：</h6>
          <ul>
            <li>1）驾乘人员或第三者的人身伤亡、财产损失、收入损失、商业利益损失、时间损失、不方便、不舒适；</li>
            <li>2）因延误、滞留、或车辆不能使用引起的通讯费、电话费、食宿费、租车费、燃料费、交通费、差旅费；</li>
            <li>2）因违反性能、时间、效率、或质量的保证所遭受的罚款等；</li>
          </ul>
          <p class="remark">注意：在车辆须经拆解才可以进行故障检测、鉴定、或评估的情况下，若拆解后发现故障不符合提供延长保修服务的条件时，拆解车辆的费用。</p>
          <h6 class="subhead">14、车辆发生故障后，车辆实际使用者在没有经过我们书面同意的情况下，对于车辆进行维修所引起的任何费用或损失；</h6>
          <h6 class="subhead">15、经国家质量技术监督检验机构或第三方专业技术机构鉴定，被延保车辆存在由于涉及制造等方面的原因而在某一批次、型号或类别的机动车辆中普遍存在的具有同一性的质量问题；</h6>
          <h6 class="subhead">16、任何原因导致的车辆价值降低损失；</h6>
          <h6 class="subhead">17、在延保合同项下的维修，已经由生产商的质保期或者其他服务合同，质量担保，机械故障保险，或维修机构担保涵盖的索赔。</h6>
        </div>
      </div>
      <div class="btn-close" @click="scopeStatus5 = false"></div>
    </div>
    <!--整车部件-->
    <div v-show="scopeStatus6" class="scope-window">
      <div class="box">
        <h3 class="title">延保产品范围</h3>
        <div class="content-wrap">
          <p class="start-text">
            本延长保修服务合约若承保车辆的零部件因材料质量和制造工艺有关的缺陷（不包含厂家召回的情形）在延长保修期内出现了故障，我们将为您承担维修费用，最高维修费用为您购买本服务合约产品中约定的赔付限额。本服务合约产品有以下保修部件范围可以选择投保：</p>
          <h5 class="main-title">一、整车部件</h5>
          <ul>
            <li>1．车辆出厂标准配置以外的任何改装、加装或零部件的变更；</li>
            <li>2．保养件：根据生产厂家规定的周期性的保养所需更换的零部件及油液，包括但不限于更换滤清器、制动片或制动盘（鼓）、灯泡、雨刮片、轮胎、皮带等保养项目；</li>
            <li>3．易损件：包括但不限于：轮圈、电池、火花塞、密封件、橡胶类部件、喷油嘴、减震器、玻璃、三元催化器、软件系统等常用易损件；</li>
            <li>4．人为、外力、噪音、油和液等流体渗漏、机油损耗（机油损耗量根据各品牌生产厂家规定的标准执行）等情况。</li>
            <li>5．所有电力驱动或者混合动力系统零部件。</li>
          </ul>
          <p class="remark">备注：全车各系统部件中，只有在修复和更换部件的组件费用超过整个组件总成本的情况下，才能更换总成。</p>

          <h5 class="main-title">二、不论哪一种保修计划，下列情形和事项下均不能获得延长保修服务：</h5>
          <h5 class="small-title">(一) 由于以下情形直接或间接导致车辆零部件（即使是被保修的零部件）发生故障：</h5>
          <h6 class="subhead">1、车辆驾驶人员未遵守保修（保养）手册中的有关操作规定，不当使用车辆，或者超出操作或使用限制范围，过度使用车辆，包括但不限于：</h6>
          <ul>
            <li>1）在车辆缺乏必要数量的冷却液或润滑油，或者仪表显示冷却液或润滑油已经过热或不足等情况下，继续驾驶车辆；</li>
            <li>2）使用与车辆制造商规定不符、不合格或者与车主手册中的规定不匹配的燃料、润滑油等油、液；</li>
            <li>3）拖拽重量超过车辆自身重量60%的其它车辆等；</li>
          </ul>
          <h6 class="subhead">2、车辆实际驾驶人员在离开车辆时，没有主动或监督门窗、车顶自动关闭系统关闭天窗、车窗、车门、或活动式车顶；</h6>
          <h6 class="subhead">3、车辆实际使用者在非约定车辆维修商处维修或者保养车辆，因维修或保养不当导致的故障；</h6>
          <h6 class="subhead">4、由于不被保修的零部件发生故障导致被保修的零部件发生损坏；</h6>
          <h6 class="subhead">5、车辆涉水行驶，发生交通事故，被外界物体撞击，自燃；</h6>
          <h6 class="subhead">6、火灾、爆炸、空中运行物体坠落、音爆；</h6>
          <h6 class="subhead">7、战争、敌对行为、军事行为、恐怖主义行为、武装冲突、罢工、民众骚乱、暴动；</h6>
          <h6 class="subhead">8、盗窃、抢劫、抢夺、诈骗行为；</h6>
          <h6 class="subhead">9、核爆炸、核反应、核辐射、放射性污染；</h6>
          <h6 class="subhead">10、地震、海啸、飓风、暴雨、洪水、雷击、火山爆发、地下火、龙卷风、暴风、冰雹等自然灾害；</h6>
          <h6 class="subhead">11、烟熏、大气、土地、水污染及其他污染；</h6>
          <h6 class="subhead">12、动物、昆虫侵入或啃咬；</h6>

          <h5 class="small-title">(二) 只要发生以下情况，无论任何原因导致车辆零部件（即使是被保修的零部件）发生故障，都不能获得延长保修服务：</h5>
          <h6 class="subhead">1、被延保车辆的发动机号码、车辆识别代号等车辆相关信息与延保服务合同中所记载的不符，或者已经被涂改；</h6>
          <h6 class="subhead">2、要求提供延保维修服务时，延长保修服务合同的服务期限尚未开始或者已经终止；</h6>
          <h6 class="subhead">3、车辆实际使用者没有按照延长保修服务合同的约定，对于车辆进行定期保养、故障维修或意外损坏修复；</h6>
          <h6 class="subhead">4、车辆被改装，不符合车辆制造商原厂规格，包括但不限于：改装或加装进排气系统零部件，改装或加装燃油系统零部件、软件变更等；</h6>
          <h6 class="subhead">5、除非符合车辆制造商原设计目的，车辆被用于竞赛、赛车前导、越野等用途；或者被用于租赁、作为出租车/计程车、教练车、配送或快递车辆等任何以盈利为目的的商业用途；</h6>
          <h6 class="subhead">6、车辆被用于公共服务(包括但不限于：警车、消防车、救护车、救助车或者军用车等)用途；</h6>
          <h6 class="subhead">7、车辆被用于非制造商原设计目的；</h6>
          <h6 class="subhead">8、车辆被政府有关当局没收、征用，或者其它类似事件使您对于车辆失去了控制；</h6>
          <h6 class="subhead">9、车辆在中国大陆（不包括香港、澳门、台湾）以外的任何地区；</h6>
          <h6 class="subhead">10、车辆的里程表失效而未被及时（48小时内）恢复，里程表连接被拆除或未连接，或者里程表读数被调整过；</h6>
          <h6 class="subhead">11、车辆实际使用者在车辆出现故障后，故意破坏其原始状态，造成故障无法被检测、鉴定、或评估；</h6>
          <h6 class="subhead">12、车辆实际使用者在车辆出现故障后，恶意夸大损失，提供不真实的证明材料，或企图使用欺诈手段谋取利益；</h6>
          <h6 class="subhead">13、车辆行驶证被吊销或者没有登记，以及车辆未按照法规检验或检验不合格。</h6>

          <h5 class="small-title">(三) 以下费用或损失，或由于以下情况引起的费用或损失，不属于延长保修服务内容，本公司不予承担：</h5>
          <h6 class="subhead">1、按照延长保修服务合同的约定，对于车辆进行定期保养所引起的费用；</h6>
          <h6 class="subhead">2、维修或更换非保修零部件所引起的费用；</h6>
          <h6 class="subhead">3、与被保修零部件无关的任何维护、保养、检测、调试、调整、或校正，包括但不限于：轮胎动平衡、车门窗密闭性校正等；</h6>
          <h6 class="subhead">4、被保修零部件仅需清洗即可恢复正常工作时的拆装和清洗等费用；</h6>
          <h6 class="subhead">5、单独车轮定位（在对被保修零部件提供延长保修服务的过程中必须进行的除外）；</h6>
          <h6 class="subhead">6、生锈、侵蚀、霉变；</h6>
          <h6 class="subhead">7、车辆没有发生故障，单纯以提高车辆的工作性能或舒适性为目的的维修所引起的费用。这种维修包括但不限于：</h6>
          <ul>
            <li>1）单纯为了提高发动机的压缩比或减少油耗，而对发动机缸体或活塞环进行的修理或更换；</li>
            <li>2）单纯为了降低车内噪音，而在车辆上添加隔音材料等；</li>
          </ul>
          <h6 class="subhead">8、延保服务合同签署时，车辆已经存在的故障所引起的维修费用；</h6>
          <h6 class="subhead">9、在车辆已经发生故障的情况下，继续行驶，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">10、在车辆已经发生故障的情况下，不及时（24小时内）向我们报告，导致故障或损失扩大的部分；</h6>
          <h6 class="subhead">11、车辆被召回维修所引起的费用；</h6>
          <h6 class="subhead">12、在维修车辆故障时，车辆内遗留的任何财/物的损失；</h6>
          <h6 class="subhead">13、车辆发生故障，或在维修期间不能使用，所引起的任何直接、间接、或衍生性费用或损失，包括但不限于：</h6>
          <ul>
            <li>1）驾乘人员或第三者的人身伤亡、财产损失、收入损失、商业利益损失、时间损失、不方便、不舒适；</li>
            <li>2）因延误、滞留、或车辆不能使用引起的通讯费、电话费、食宿费、租车费、燃料费、交通费、差旅费；</li>
            <li>2）因违反性能、时间、效率、或质量的保证所遭受的罚款等；</li>
            <li>4）在车辆须经拆解才可以进行故障检测、鉴定、或评估的情况下，若拆解后发现故障不符合提供延长保修服务的条件时，拆解车辆的费用。</li>
          </ul>
          <h6 class="subhead">14、车辆发生故障后，车辆实际使用者在没有经过我们书面同意的情况下，对于车辆进行维修所引起的任何费用或损失；</h6>
          <h6 class="subhead">15、经国家质量技术监督检验机构或第三方专业技术机构鉴定，被延保车辆存在由于涉及制造等方面的原因而在某一批次、型号或类别的机动车辆中普遍存在的具有同一性的质量问题；</h6>
          <h6 class="subhead">16、任何原因导致的车辆价值降低损失；</h6>
          <h6 class="subhead">17、在延保合同项下的维修，已经由生产商的质保期或者其他服务合同，质量担保，机械故障保险，或维修机构担保涵盖的索赔。</h6>
        </div>
      </div>
      <div class="btn-close" @click="scopeStatus6 = false"></div>
    </div>

    <!--查看理赔流程弹窗-->
    <div class="claims" v-show="claims">
      <div class="content">
        <h4 class="title">理赔流程</h4>

        <div class="wrap">
          <p>当车辆发生故障时，立即拨打艾普利服务热线 400 029 7790 报案寻求帮助。按照根据指引或就近品牌店进行检测并收集相关如下理赔证明材料。如车辆故障属于延保服务合约里的索赔范围，客户可按照延保服务合约里确认的理赔定损标准进行车辆维修。车辆修复后将相关理赔材料交给服务团队人员办理理赔事宜。</p>
          <p>客户在申请索赔时应当向艾普利提供以下有效证明材料：</p>
          <ul>
            <li>（1）车主购买车辆后按照车主手册规定进行定期保养记录证明文件和票据单证;</li>
            <li>（2）车辆事故原因分析报告和相关资料; 车辆出险索赔时已行驶公里数和车架号车牌号等资料的截取影像资料</li>
            <li>（3）车辆维修报价单和发票;</li>
            <li>（4）车辆机械、电气、电子部件的拆检照片；（远距离拍摄清楚器件外观及内部全貌，近距离拍摄清晰的厂家标识、总成零件号等）</li>
            <li>（5）车辆维修更换的机械、电气、电子部件;</li>
            <li>（6）车辆修复后车主的确认书;</li>
            <li>（7）其他根据案件的情况需补充提供的资料。</li>
          </ul>
          <p class="phone">客户服务热线：400 029 7790</p>
        </div>
      </div>
      <div class="btn-close" @click="claims = false"></div>
    </div>

  </div>
</template>

<script>
  import {conf} from "../assets/js/main"

  export default {
    name: "service-details",
    data() {
      return {
        //是否通过审核
        passStatus: false,
        //电子合约状态
        contractStatus: false,
        //支付状态
        payStatus: false,
        //准入条件选中状态
        entryStatus: true,
        //保障范围选中状态
        scopeStatus: true,
        //理赔流程选中状态
        flowStatus: true,
        //是否阅读协议
        readStatus: true,
        showContract: false,
        id: this.$route.query.id,
        detail: '',
        //最终保障里程
        range: "",

        /*准入条件弹窗*/
        condition: false,
        /*保障范围弹窗*/
        scopeStatus1: false,
        scopeStatus2: false,
        scopeStatus3: false,
        scopeStatus4: false,
        scopeStatus5: false,
        scopeStatus6: false,
        /*理赔流程弹窗*/
        claims: false,
      }
    },
    created() {
      conf.setTitle("服务详情");
      if(this.$route.query.type === "1") {
        this.flag = 1;
      }
    },
    mounted() {
      this.getData();
      this.range = conf.getItem("range");
      // console.log(this.detail.guaranteeScope)
    },
    beforeDestroy() {//实例销毁之前调用，如果是支付完成跳过来的，按返回跳到个人中心
      if(this.flag) {
        this.$router.push("/personal");
      }
    },
    methods: {
      getData() {
        conf.loading("加载中...");
        conf.get("/api/order/detail?id=" + this.id, response => {
          if (response.result === 1) {
            setTimeout(() => {
              conf.closeLoading();
            }, 200);
            this.detail = response.data;

            if (response.data.status === 1 && response.data.payStatus === 1) {
              this.passStatus = true;
              this.contractStatus = true;
            }
            if (response.data.status === 0 && response.data.payStatus === 0) {//待支付
              this.payStatus = true;
            }
            /*if (response.data.status === 0 && response.data.payStatus === 0) {

            }*/
          } else {
            conf.closeLoading();
            conf.toast(response.msg);
          }
        })
      },
      confirmPay() {
        if (this.entryStatus && this.scopeStatus && this.flowStatus && this.readStatus) {
          this.$router.push("/payment?id=" + this.id + "&price=" + this.detail.cost);
        } else {
          conf.toast("请勾选以上协议");
        }
      },
      seaContract() {
        location.href = this.detail.contractPdf;
      },

      fnPrompt(){
        let val = this.detail.guaranteeScope;

        if (val.indexOf("一大件") != -1) {
          this.scopeStatus1 = true;
        } else if (val.indexOf("二大件") != -1) {
          this.scopeStatus2 = true;
        } else if (val.indexOf("三大件") != -1) {
          this.scopeStatus3 = true;
        } else if (val.indexOf("六大系统") != -1) {
          this.scopeStatus4 = true;
        } else if (val.indexOf("十一大") != -1) {
          this.scopeStatus5 = true;
        } else if (val.indexOf("整车部件") != -1) {
          this.scopeStatus6 = true;
        }
      }
    }
  }
</script>

<style scoped lang="less">
  .service-details {
    min-height: 100vh;
    background-color: #f5f5f5;
    padding-bottom: 88/75rem;
  }

  .box1, .box2, .box3, .box4, .box5 {
    background-color: #fff;
    margin-bottom: 20/75rem;
  }

  .danger {
    color: #ff5555 !important;
  }

  .head {
    height: 88/75rem;
    padding: 0 30/75rem;
    .wrap {
      height: 100%;
      display: flex;
      align-items: center;
      border-bottom: 1px solid #e5e5e5;
      font-size: 32/75rem;
      color: #5b87d3;
      i {
        display: block;
        width: 36/75rem;
        height: 46/75rem;
        background-repeat: no-repeat;
        background-position: center;
        -webkit-background-size: 100%;
        background-size: 100%;
        margin-right: 18/75rem;
        &.icon-owner {
          background-image: url("../assets/img/icon_owner_message.png");
        }
        &.icon-car {
          background-image: url("../assets/img/icon_car_messgae.png");
        }
        &.icon-extend {
          background-image: url("../assets/img/icon_extended_warranty_message.png");
        }
      }
    }
  }

  .list {
    padding: 0 30/75rem;
    li {
      display: flex;
      align-items: center;
      justify-content: space-between;
      padding: 30/75rem 0;
      font-size: 30/75rem;
      .left-text {
        color: #666;
        .blue-text {
          display: block;
          font-size: 24/75rem;
          color: #5b87d3;
          margin-top: 15/75rem;
        }
      }
      .right-text {
        color: #333;
      }
    }
  }

  .box1 {
    height: 88/75rem;
    display: flex;
    align-items: center;
    justify-content: space-between;
    padding: 0 30/75rem;
    margin-bottom: 20/75rem;
    span {
      &.left {
        font-size: 30/75rem;
        color: #333;
      }
      &.status {
        font-size: 28/75rem;
        color: #5b87d3;
      }
    }
  }

  .box2 {
    padding: 0 !important;
    .bottom-line {
      width: 100%;
    }
    .list {
      .right-text {
        display: block;
        width: 390/75rem;
        text-align: right;
      }
    }
  }

  .box5 {
    height: 88/75rem;
    font-size: 30/75rem;
    padding: 0 30/75rem;
    display: flex;
    align-items: center;
    justify-content: space-between;
    margin-bottom: 20/75rem;
    .left-text {
      color: #666;
    }
  }

  .wrapper {
    .btn {
      width: 100%;
      height: 88/75rem;
      font-size: 32/75rem;
      color: #fff;
      background-color: #5b87d3 !important;
      line-height: 88/75rem;
      text-align: center;
      position: fixed;
      bottom: 0;
      max-width: 600px;
    }
  }

  .deal-list {
    background-color: #fff;
    padding: 0 30/75rem;
    li {
      height: 96/75rem;
      border-bottom: 1px solid #e5e5e5;
      display: flex;
      align-items: center;
      justify-content: space-between;
      font-size: 30/75rem;
      em {
        color: #333;
        span {
          color: #5b87d3;
        }
      }
      i {
        display: block;
        width: 36/75rem;
        height: 36/75rem;
        background-repeat: no-repeat;
        background-position: center;
        -webkit-background-size: 100%;
        background-size: 100%;
      }
      i.icon-checkbox {
        background-image: url("../assets/img/checkbox1.png");
      }
      i.icon-checked {
        background-image: url("../assets/img/checked1.png");
      }
    }
  }

  .read {
    padding: 40/75rem 30/75rem;
    display: flex;
    align-items: center;
    justify-content: space-between;
    i {
      display: block;
      width: 36/75rem;
      height: 36/75rem;
      background-repeat: no-repeat;
      background-position: center;
      background-size: 100%;
      &.icon-check {
        background-image: url("../assets/img/checkbox2.png");
      }
      &.icon-checkeds {
        background-image: url("../assets/img/checked2.png");
      }
    }
    .deal-text {
      font-size: 26/75rem;
      color: #666;
      width: 620/75rem;
      line-height: 35/75rem;
    }
  }

  .footer {
    width: 100%;
    height: 108/75rem;
    display: flex;
    align-items: center;
    justify-content: space-between;
    position: fixed;
    bottom: 0;
    max-width: 600px;
    background-color: #fff;
    .left {
      font-size: 36/75rem;
      color: #333;
      margin-left: 30/75rem;
      span {
        font-size: 32/75rem;
        color: #5b87d3;
        margin-left: 20/75rem;
      }
    }
    .btn-pay {
      width: 280/75rem;
      height: 100%;
      line-height: 108/75rem;
      color: #fff;
      text-align: center;
      font-size: 32/75rem;
      background-color: #5b87d3;
    }
  }

  .e-contract, .condition, .safeguard, .claims {
    position: fixed;
    top: 0;
    width: 100%;
    max-width: 600px;
    height: 100vh;
    background-color: rgba(0, 0, 0, .5);
    z-index: 10;
    .content {
      width: 690/75rem;
      height: 85%;
      background-color: #fff;
      -webkit-border-radius: 15/75rem;
      -moz-border-radius: 15/75rem;
      border-radius: 15/75rem;
      margin: 50/75rem auto 0;
      padding: 40/75rem;
      overflow: hidden;
      .title {
        text-align: center;
        font-size: 36/75rem;
        color: #121212;
        margin-bottom: 30/75rem;
        font-weight: 600;
      }
      .wrap {
        width: 100%;
        height: 90%;
        overflow-y: scroll;
        &::-webkit-scrollbar {
          display: none;
        }
        img {
          display: block;
          width: 100%;
        }
        .main-title {
          font-size: 32/75rem;
          font-weight: 600;
        }
        .subhead {
          font-size: 32/75rem;
          font-weight: 600;
          margin: 25/75rem 0;
        }
        li{
          margin: 10/75rem 0;
          font-size: 28/75rem;
          line-height: 45/75rem;
          color: #666;
        }
        .phone{
          margin-top: 50/75rem;
        }
        p {
          font-size: 30/75rem;
          margin-bottom: 30/75rem;
          color: #333;
          line-height: 40/75rem;
        }
      }
    }
    .btn-close {
      width: 64/75rem;
      height: 64/75rem;
      background: url("../assets/img/button_close.png") 0 0 no-repeat;
      -webkit-background-size: 100%;
      background-size: 100%;
      margin: 40/75rem auto;
    }
  }



  .scope-window {
    width: 100%;
    max-width: 600px;
    height: 100vh;
    position: fixed;
    top: 0;
    z-index: 20;
    background-color: rgba(0, 0, 0, .5);
    padding: 30/75rem;
    .box {
      width: 100%;
      height: 85%;
      background-color: #fff;
      -webkit-border-radius: 20/75rem;
      -moz-border-radius: 20/75rem;
      border-radius: 20/75rem;
      padding: 40/75rem;
      margin-top: 60/75rem;
      overflow: hidden;

      .title {
        font-size: 36/75rem;
        color: #121212;
        font-weight: 600;
        text-align: center;
        margin-bottom: 30/75rem;
      }

      .content-wrap {
        height: 90%;
        overflow-y: scroll;
        &::-webkit-scrollbar {
          display: none;
        }
        .start-text {
          color: #121212;
          padding-bottom: 20/75rem;
        }

        .main-title {
          font-size: 32/75rem;
          font-weight: 600;
        }
        .small-title {
          font-size: 30/75rem;
          font-weight: 600;
          margin: 20/75rem 0;
        }
        .subhead {
          font-size: 28/75rem;
          font-weight: 600;
          margin: 25/75rem 0;
        }
        .remark {
          margin: 20/75rem 0;
          font-size: 26/75rem;
          color: red;
        }
        p {
          font-size: 28/75rem;
          color: #666;
          line-height: 40/75rem;
        }
        ul {
          margin: 20/75rem 0;
          li {
            color: #666;
            margin: 10/75rem 0;
            font-size: 28/75rem;
            line-height: 40/75rem;
          }
        }
      }
    }

    .btn-close {
      width: 64/75rem;
      height: 64/75rem;
      background: url("../assets/img/button_close.png") 0 0 no-repeat;
      -webkit-background-size: 100%;
      background-size: 100%;
      margin: 40/75rem auto;
    }
  }
</style>
